GopalSaraf/Practicals/PSDL/include/proc/pic18f46q84.inc
// Register: C1TBCT
#define C1TBCT C1TBCT
C1TBCT                                   equ 0113h
// bitfield definitions
C1TBCT_TBC_POSN                          equ 0000h
C1TBCT_TBC_POSITION                      equ 0000h
C1TBCT_TBC_SIZE                          equ 0008h
C1TBCT_TBC_LENGTH                        equ 0008h
C1TBCT_TBC_MASK                          equ 00FFh
C1TBCT_TBC24_POSN                        equ 0000h
C1TBCT_TBC24_POSITION                    equ 0000h
C1TBCT_TBC24_SIZE                        equ 0001h
C1TBCT_TBC24_LENGTH                      equ 0001h
C1TBCT_TBC24_MASK                        equ 0001h
C1TBCT_TBC25_POSN                        equ 0001h
C1TBCT_TBC25_POSITION                    equ 0001h
C1TBCT_TBC25_SIZE                        equ 0001h
C1TBCT_TBC25_LENGTH                      equ 0001h
C1TBCT_TBC25_MASK                        equ 0002h
C1TBCT_TBC26_POSN                        equ 0002h
C1TBCT_TBC26_POSITION                    equ 0002h
C1TBCT_TBC26_SIZE                        equ 0001h
C1TBCT_TBC26_LENGTH                      equ 0001h
C1TBCT_TBC26_MASK                        equ 0004h
C1TBCT_TBC27_POSN                        equ 0003h
C1TBCT_TBC27_POSITION                    equ 0003h
C1TBCT_TBC27_SIZE                        equ 0001h
C1TBCT_TBC27_LENGTH                      equ 0001h
C1TBCT_TBC27_MASK                        equ 0008h
C1TBCT_TBC28_POSN                        equ 0004h
C1TBCT_TBC28_POSITION                    equ 0004h
C1TBCT_TBC28_SIZE                        equ 0001h
C1TBCT_TBC28_LENGTH                      equ 0001h
C1TBCT_TBC28_MASK                        equ 0010h
C1TBCT_TBC29_POSN                        equ 0005h
C1TBCT_TBC29_POSITION                    equ 0005h
C1TBCT_TBC29_SIZE                        equ 0001h
C1TBCT_TBC29_LENGTH                      equ 0001h
C1TBCT_TBC29_MASK                        equ 0020h
C1TBCT_TBC30_POSN                        equ 0006h
C1TBCT_TBC30_POSITION                    equ 0006h
C1TBCT_TBC30_SIZE                        equ 0001h
C1TBCT_TBC30_LENGTH                      equ 0001h
C1TBCT_TBC30_MASK                        equ 0040h
C1TBCT_TBC31_POSN                        equ 0007h
C1TBCT_TBC31_POSITION                    equ 0007h
C1TBCT_TBC31_SIZE                        equ 0001h
C1TBCT_TBC31_LENGTH                      equ 0001h
C1TBCT_TBC31_MASK                        equ 0080h

// Register: C1TSCONL
#define C1TSCONL C1TSCONL
C1TSCONL                                 equ 0114h
// bitfield definitions
C1TSCONL_TBCPRE_POSN                     equ 0000h
C1TSCONL_TBCPRE_POSITION                 equ 0000h
C1TSCONL_TBCPRE_SIZE                     equ 0008h
C1TSCONL_TBCPRE_LENGTH                   equ 0008h
C1TSCONL_TBCPRE_MASK                     equ 00FFh
C1TSCONL_TBCPRE0_POSN                    equ 0000h
C1TSCONL_TBCPRE0_POSITION                equ 0000h
C1TSCONL_TBCPRE0_SIZE                    equ 0001h
C1TSCONL_TBCPRE0_LENGTH                  equ 0001h
C1TSCONL_TBCPRE0_MASK                    equ 0001h
C1TSCONL_TBCPRE1_POSN                    equ 0001h
C1TSCONL_TBCPRE1_POSITION                equ 0001h
C1TSCONL_TBCPRE1_SIZE                    equ 0001h
C1TSCONL_TBCPRE1_LENGTH                  equ 0001h
C1TSCONL_TBCPRE1_MASK                    equ 0002h
C1TSCONL_TBCPRE2_POSN                    equ 0002h
C1TSCONL_TBCPRE2_POSITION                equ 0002h
C1TSCONL_TBCPRE2_SIZE                    equ 0001h
C1TSCONL_TBCPRE2_LENGTH                  equ 0001h
C1TSCONL_TBCPRE2_MASK                    equ 0004h
C1TSCONL_TBCPRE3_POSN                    equ 0003h
C1TSCONL_TBCPRE3_POSITION                equ 0003h
C1TSCONL_TBCPRE3_SIZE                    equ 0001h
C1TSCONL_TBCPRE3_LENGTH                  equ 0001h
C1TSCONL_TBCPRE3_MASK                    equ 0008h
C1TSCONL_TBCPRE4_POSN                    equ 0004h
C1TSCONL_TBCPRE4_POSITION                equ 0004h
C1TSCONL_TBCPRE4_SIZE                    equ 0001h
C1TSCONL_TBCPRE4_LENGTH                  equ 0001h
C1TSCONL_TBCPRE4_MASK                    equ 0010h
C1TSCONL_TBCPRE5_POSN                    equ 0005h
C1TSCONL_TBCPRE5_POSITION                equ 0005h
C1TSCONL_TBCPRE5_SIZE                    equ 0001h
C1TSCONL_TBCPRE5_LENGTH                  equ 0001h
C1TSCONL_TBCPRE5_MASK                    equ 0020h
C1TSCONL_TBCPRE6_POSN                    equ 0006h
C1TSCONL_TBCPRE6_POSITION                equ 0006h
C1TSCONL_TBCPRE6_SIZE                    equ 0001h
C1TSCONL_TBCPRE6_LENGTH                  equ 0001h
C1TSCONL_TBCPRE6_MASK                    equ 0040h
C1TSCONL_TBCPRE7_POSN                    equ 0007h
C1TSCONL_TBCPRE7_POSITION                equ 0007h
C1TSCONL_TBCPRE7_SIZE                    equ 0001h
C1TSCONL_TBCPRE7_LENGTH                  equ 0001h
C1TSCONL_TBCPRE7_MASK                    equ 0080h

// Register: C1TSCONH
#define C1TSCONH C1TSCONH
C1TSCONH                                 equ 0115h
// bitfield definitions
C1TSCONH_TBCPRE_POSN                     equ 0000h
C1TSCONH_TBCPRE_POSITION                 equ 0000h
C1TSCONH_TBCPRE_SIZE                     equ 0002h
C1TSCONH_TBCPRE_LENGTH                   equ 0002h
C1TSCONH_TBCPRE_MASK                     equ 0003h
C1TSCONH_TBCPRE8_POSN                    equ 0000h
C1TSCONH_TBCPRE8_POSITION                equ 0000h
C1TSCONH_TBCPRE8_SIZE                    equ 0001h
C1TSCONH_TBCPRE8_LENGTH                  equ 0001h
C1TSCONH_TBCPRE8_MASK                    equ 0001h
C1TSCONH_TBCPRE9_POSN                    equ 0001h
C1TSCONH_TBCPRE9_POSITION                equ 0001h
C1TSCONH_TBCPRE9_SIZE                    equ 0001h
C1TSCONH_TBCPRE9_LENGTH                  equ 0001h
C1TSCONH_TBCPRE9_MASK                    equ 0002h

// Register: C1TSCONU
#define C1TSCONU C1TSCONU
C1TSCONU                                 equ 0116h
// bitfield definitions
C1TSCONU_TBCEN_POSN                      equ 0000h
C1TSCONU_TBCEN_POSITION                  equ 0000h
C1TSCONU_TBCEN_SIZE                      equ 0001h
C1TSCONU_TBCEN_LENGTH                    equ 0001h
C1TSCONU_TBCEN_MASK                      equ 0001h
C1TSCONU_TSEOF_POSN                      equ 0001h
C1TSCONU_TSEOF_POSITION                  equ 0001h
C1TSCONU_TSEOF_SIZE                      equ 0001h
C1TSCONU_TSEOF_LENGTH                    equ 0001h
C1TSCONU_TSEOF_MASK                      equ 0002h
C1TSCONU_TSRES_POSN                      equ 0002h
C1TSCONU_TSRES_POSITION                  equ 0002h
C1TSCONU_TSRES_SIZE                      equ 0001h
C1TSCONU_TSRES_LENGTH                    equ 0001h
C1TSCONU_TSRES_MASK                      equ 0004h

// Register: C1TSCONT
#define C1TSCONT C1TSCONT
C1TSCONT                                 equ 0117h

