GopalSaraf/Practicals/PSDL/include/proc/pic18f46q84.inc
// Register: C1VECL
#define C1VECL C1VECL
C1VECL                                   equ 0118h
// bitfield definitions
C1VECL_ICODE_POSN                        equ 0000h
C1VECL_ICODE_POSITION                    equ 0000h
C1VECL_ICODE_SIZE                        equ 0007h
C1VECL_ICODE_LENGTH                      equ 0007h
C1VECL_ICODE_MASK                        equ 007Fh

// Register: C1VECH
#define C1VECH C1VECH
C1VECH                                   equ 0119h
// bitfield definitions
C1VECH_FILHIT_POSN                       equ 0000h
C1VECH_FILHIT_POSITION                   equ 0000h
C1VECH_FILHIT_SIZE                       equ 0005h
C1VECH_FILHIT_LENGTH                     equ 0005h
C1VECH_FILHIT_MASK                       equ 001Fh

// Register: C1VECU
#define C1VECU C1VECU
C1VECU                                   equ 011Ah
// bitfield definitions
C1VECU_TXCODE_POSN                       equ 0000h
C1VECU_TXCODE_POSITION                   equ 0000h
C1VECU_TXCODE_SIZE                       equ 0007h
C1VECU_TXCODE_LENGTH                     equ 0007h
C1VECU_TXCODE_MASK                       equ 007Fh

// Register: C1VECT
#define C1VECT C1VECT
C1VECT                                   equ 011Bh
// bitfield definitions
C1VECT_RXCODE_POSN                       equ 0000h
C1VECT_RXCODE_POSITION                   equ 0000h
C1VECT_RXCODE_SIZE                       equ 0007h
C1VECT_RXCODE_LENGTH                     equ 0007h
C1VECT_RXCODE_MASK                       equ 007Fh

// Register: C1INTL
#define C1INTL C1INTL
C1INTL                                   equ 011Ch
// bitfield definitions
C1INTL_TXIF_POSN                         equ 0000h
C1INTL_TXIF_POSITION                     equ 0000h
C1INTL_TXIF_SIZE                         equ 0001h
C1INTL_TXIF_LENGTH                       equ 0001h
C1INTL_TXIF_MASK                         equ 0001h
C1INTL_RXIF_POSN                         equ 0001h
C1INTL_RXIF_POSITION                     equ 0001h
C1INTL_RXIF_SIZE                         equ 0001h
C1INTL_RXIF_LENGTH                       equ 0001h
C1INTL_RXIF_MASK                         equ 0002h
C1INTL_TBCIF_POSN                        equ 0002h
C1INTL_TBCIF_POSITION                    equ 0002h
C1INTL_TBCIF_SIZE                        equ 0001h
C1INTL_TBCIF_LENGTH                      equ 0001h
C1INTL_TBCIF_MASK                        equ 0004h
C1INTL_MODIF_POSN                        equ 0003h
C1INTL_MODIF_POSITION                    equ 0003h
C1INTL_MODIF_SIZE                        equ 0001h
C1INTL_MODIF_LENGTH                      equ 0001h
C1INTL_MODIF_MASK                        equ 0008h
C1INTL_TEFIF_POSN                        equ 0004h
C1INTL_TEFIF_POSITION                    equ 0004h
C1INTL_TEFIF_SIZE                        equ 0001h
C1INTL_TEFIF_LENGTH                      equ 0001h
C1INTL_TEFIF_MASK                        equ 0010h

// Register: C1INTH
#define C1INTH C1INTH
C1INTH                                   equ 011Dh
// bitfield definitions
C1INTH_TXATIF_POSN                       equ 0002h
C1INTH_TXATIF_POSITION                   equ 0002h
C1INTH_TXATIF_SIZE                       equ 0001h
C1INTH_TXATIF_LENGTH                     equ 0001h
C1INTH_TXATIF_MASK                       equ 0004h
C1INTH_RXOVIF_POSN                       equ 0003h
C1INTH_RXOVIF_POSITION                   equ 0003h
C1INTH_RXOVIF_SIZE                       equ 0001h
C1INTH_RXOVIF_LENGTH                     equ 0001h
C1INTH_RXOVIF_MASK                       equ 0008h
C1INTH_SERRIF_POSN                       equ 0004h
C1INTH_SERRIF_POSITION                   equ 0004h
C1INTH_SERRIF_SIZE                       equ 0001h
C1INTH_SERRIF_LENGTH                     equ 0001h
C1INTH_SERRIF_MASK                       equ 0010h
C1INTH_CERRIF_POSN                       equ 0005h
C1INTH_CERRIF_POSITION                   equ 0005h
C1INTH_CERRIF_SIZE                       equ 0001h
C1INTH_CERRIF_LENGTH                     equ 0001h
C1INTH_CERRIF_MASK                       equ 0020h
C1INTH_WAKIF_POSN                        equ 0006h
C1INTH_WAKIF_POSITION                    equ 0006h
C1INTH_WAKIF_SIZE                        equ 0001h
C1INTH_WAKIF_LENGTH                      equ 0001h
C1INTH_WAKIF_MASK                        equ 0040h
C1INTH_IVMIF_POSN                        equ 0007h
C1INTH_IVMIF_POSITION                    equ 0007h
C1INTH_IVMIF_SIZE                        equ 0001h
C1INTH_IVMIF_LENGTH                      equ 0001h
C1INTH_IVMIF_MASK                        equ 0080h

// Register: C1INTU
#define C1INTU C1INTU
C1INTU                                   equ 011Eh
// bitfield definitions
C1INTU_TXIE_POSN                         equ 0000h
C1INTU_TXIE_POSITION                     equ 0000h
C1INTU_TXIE_SIZE                         equ 0001h
C1INTU_TXIE_LENGTH                       equ 0001h
C1INTU_TXIE_MASK                         equ 0001h
C1INTU_RXIE_POSN                         equ 0001h
C1INTU_RXIE_POSITION                     equ 0001h
C1INTU_RXIE_SIZE                         equ 0001h
C1INTU_RXIE_LENGTH                       equ 0001h
C1INTU_RXIE_MASK                         equ 0002h
C1INTU_TBCIE_POSN                        equ 0002h
C1INTU_TBCIE_POSITION                    equ 0002h
C1INTU_TBCIE_SIZE                        equ 0001h
C1INTU_TBCIE_LENGTH                      equ 0001h
C1INTU_TBCIE_MASK                        equ 0004h
C1INTU_MODIE_POSN                        equ 0003h
C1INTU_MODIE_POSITION                    equ 0003h
C1INTU_MODIE_SIZE                        equ 0001h
C1INTU_MODIE_LENGTH                      equ 0001h
C1INTU_MODIE_MASK                        equ 0008h
C1INTU_TEFIE_POSN                        equ 0004h
C1INTU_TEFIE_POSITION                    equ 0004h
C1INTU_TEFIE_SIZE                        equ 0001h
C1INTU_TEFIE_LENGTH                      equ 0001h
C1INTU_TEFIE_MASK                        equ 0010h

// Register: C1INTT
#define C1INTT C1INTT
C1INTT                                   equ 011Fh
// bitfield definitions
C1INTT_TXATIE_POSN                       equ 0002h
C1INTT_TXATIE_POSITION                   equ 0002h
C1INTT_TXATIE_SIZE                       equ 0001h
C1INTT_TXATIE_LENGTH                     equ 0001h
C1INTT_TXATIE_MASK                       equ 0004h
C1INTT_RXOVIE_POSN                       equ 0003h
C1INTT_RXOVIE_POSITION                   equ 0003h
C1INTT_RXOVIE_SIZE                       equ 0001h
C1INTT_RXOVIE_LENGTH                     equ 0001h
C1INTT_RXOVIE_MASK                       equ 0008h
C1INTT_SERRIE_POSN                       equ 0004h
C1INTT_SERRIE_POSITION                   equ 0004h
C1INTT_SERRIE_SIZE                       equ 0001h
C1INTT_SERRIE_LENGTH                     equ 0001h
C1INTT_SERRIE_MASK                       equ 0010h
C1INTT_CERRIE_POSN                       equ 0005h
C1INTT_CERRIE_POSITION                   equ 0005h
C1INTT_CERRIE_SIZE                       equ 0001h
C1INTT_CERRIE_LENGTH                     equ 0001h
C1INTT_CERRIE_MASK                       equ 0020h
C1INTT_WAKIE_POSN                        equ 0006h
C1INTT_WAKIE_POSITION                    equ 0006h
C1INTT_WAKIE_SIZE                        equ 0001h
C1INTT_WAKIE_LENGTH                      equ 0001h
C1INTT_WAKIE_MASK                        equ 0040h
C1INTT_IVMIE_POSN                        equ 0007h
C1INTT_IVMIE_POSITION                    equ 0007h
C1INTT_IVMIE_SIZE                        equ 0001h
C1INTT_IVMIE_LENGTH                      equ 0001h
C1INTT_IVMIE_MASK                        equ 0080h

