GopalSaraf/Practicals/PSDL/include/proc/pic18f46q84.inc
// Register: C1BDIAG1L
#define C1BDIAG1L C1BDIAG1L
C1BDIAG1L                                equ 013Ch
// bitfield definitions
C1BDIAG1L_EFMSGCNT_POSN                  equ 0000h
C1BDIAG1L_EFMSGCNT_POSITION              equ 0000h
C1BDIAG1L_EFMSGCNT_SIZE                  equ 0008h
C1BDIAG1L_EFMSGCNT_LENGTH                equ 0008h
C1BDIAG1L_EFMSGCNT_MASK                  equ 00FFh
C1BDIAG1L_EFMSGCNT0_POSN                 equ 0000h
C1BDIAG1L_EFMSGCNT0_POSITION             equ 0000h
C1BDIAG1L_EFMSGCNT0_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT0_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT0_MASK                 equ 0001h
C1BDIAG1L_EFMSGCNT1_POSN                 equ 0001h
C1BDIAG1L_EFMSGCNT1_POSITION             equ 0001h
C1BDIAG1L_EFMSGCNT1_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT1_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT1_MASK                 equ 0002h
C1BDIAG1L_EFMSGCNT2_POSN                 equ 0002h
C1BDIAG1L_EFMSGCNT2_POSITION             equ 0002h
C1BDIAG1L_EFMSGCNT2_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT2_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT2_MASK                 equ 0004h
C1BDIAG1L_EFMSGCNT3_POSN                 equ 0003h
C1BDIAG1L_EFMSGCNT3_POSITION             equ 0003h
C1BDIAG1L_EFMSGCNT3_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT3_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT3_MASK                 equ 0008h
C1BDIAG1L_EFMSGCNT4_POSN                 equ 0004h
C1BDIAG1L_EFMSGCNT4_POSITION             equ 0004h
C1BDIAG1L_EFMSGCNT4_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT4_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT4_MASK                 equ 0010h
C1BDIAG1L_EFMSGCNT5_POSN                 equ 0005h
C1BDIAG1L_EFMSGCNT5_POSITION             equ 0005h
C1BDIAG1L_EFMSGCNT5_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT5_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT5_MASK                 equ 0020h
C1BDIAG1L_EFMSGCNT6_POSN                 equ 0006h
C1BDIAG1L_EFMSGCNT6_POSITION             equ 0006h
C1BDIAG1L_EFMSGCNT6_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT6_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT6_MASK                 equ 0040h
C1BDIAG1L_EFMSGCNT7_POSN                 equ 0007h
C1BDIAG1L_EFMSGCNT7_POSITION             equ 0007h
C1BDIAG1L_EFMSGCNT7_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT7_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT7_MASK                 equ 0080h

// Register: C1BDIAG1H
#define C1BDIAG1H C1BDIAG1H
C1BDIAG1H                                equ 013Dh
// bitfield definitions
C1BDIAG1H_EFMSGCNT_POSN                  equ 0000h
C1BDIAG1H_EFMSGCNT_POSITION              equ 0000h
C1BDIAG1H_EFMSGCNT_SIZE                  equ 0008h
C1BDIAG1H_EFMSGCNT_LENGTH                equ 0008h
C1BDIAG1H_EFMSGCNT_MASK                  equ 00FFh
C1BDIAG1H_EFMSGCNT8_POSN                 equ 0000h
C1BDIAG1H_EFMSGCNT8_POSITION             equ 0000h
C1BDIAG1H_EFMSGCNT8_SIZE                 equ 0001h
C1BDIAG1H_EFMSGCNT8_LENGTH               equ 0001h
C1BDIAG1H_EFMSGCNT8_MASK                 equ 0001h
C1BDIAG1H_EFMSGCNT9_POSN                 equ 0001h
C1BDIAG1H_EFMSGCNT9_POSITION             equ 0001h
C1BDIAG1H_EFMSGCNT9_SIZE                 equ 0001h
C1BDIAG1H_EFMSGCNT9_LENGTH               equ 0001h
C1BDIAG1H_EFMSGCNT9_MASK                 equ 0002h
C1BDIAG1H_EFMSGCNT10_POSN                equ 0002h
C1BDIAG1H_EFMSGCNT10_POSITION            equ 0002h
C1BDIAG1H_EFMSGCNT10_SIZE                equ 0001h
C1BDIAG1H_EFMSGCNT10_LENGTH              equ 0001h
C1BDIAG1H_EFMSGCNT10_MASK                equ 0004h
C1BDIAG1H_EFMSGCNT11_POSN                equ 0003h
C1BDIAG1H_EFMSGCNT11_POSITION            equ 0003h
C1BDIAG1H_EFMSGCNT11_SIZE                equ 0001h
C1BDIAG1H_EFMSGCNT11_LENGTH              equ 0001h
C1BDIAG1H_EFMSGCNT11_MASK                equ 0008h
C1BDIAG1H_EFMSGCNT12_POSN                equ 0004h
C1BDIAG1H_EFMSGCNT12_POSITION            equ 0004h
C1BDIAG1H_EFMSGCNT12_SIZE                equ 0001h
C1BDIAG1H_EFMSGCNT12_LENGTH              equ 0001h
C1BDIAG1H_EFMSGCNT12_MASK                equ 0010h
C1BDIAG1H_EFMSGCNT13_POSN                equ 0005h
C1BDIAG1H_EFMSGCNT13_POSITION            equ 0005h
C1BDIAG1H_EFMSGCNT13_SIZE                equ 0001h
C1BDIAG1H_EFMSGCNT13_LENGTH              equ 0001h
C1BDIAG1H_EFMSGCNT13_MASK                equ 0020h
C1BDIAG1H_EFMSGCNT14_POSN                equ 0006h
C1BDIAG1H_EFMSGCNT14_POSITION            equ 0006h
C1BDIAG1H_EFMSGCNT14_SIZE                equ 0001h
C1BDIAG1H_EFMSGCNT14_LENGTH              equ 0001h
C1BDIAG1H_EFMSGCNT14_MASK                equ 0040h
C1BDIAG1H_EFMSGCNT15_POSN                equ 0007h
C1BDIAG1H_EFMSGCNT15_POSITION            equ 0007h
C1BDIAG1H_EFMSGCNT15_SIZE                equ 0001h
C1BDIAG1H_EFMSGCNT15_LENGTH              equ 0001h
C1BDIAG1H_EFMSGCNT15_MASK                equ 0080h

// Register: C1BDIAG1U
#define C1BDIAG1U C1BDIAG1U
C1BDIAG1U                                equ 013Eh
// bitfield definitions
C1BDIAG1U_NBIT0ERR_POSN                  equ 0000h
C1BDIAG1U_NBIT0ERR_POSITION              equ 0000h
C1BDIAG1U_NBIT0ERR_SIZE                  equ 0001h
C1BDIAG1U_NBIT0ERR_LENGTH                equ 0001h
C1BDIAG1U_NBIT0ERR_MASK                  equ 0001h
C1BDIAG1U_NBIT1ERR_POSN                  equ 0001h
C1BDIAG1U_NBIT1ERR_POSITION              equ 0001h
C1BDIAG1U_NBIT1ERR_SIZE                  equ 0001h
C1BDIAG1U_NBIT1ERR_LENGTH                equ 0001h
C1BDIAG1U_NBIT1ERR_MASK                  equ 0002h
C1BDIAG1U_NACKERR_POSN                   equ 0002h
C1BDIAG1U_NACKERR_POSITION               equ 0002h
C1BDIAG1U_NACKERR_SIZE                   equ 0001h
C1BDIAG1U_NACKERR_LENGTH                 equ 0001h
C1BDIAG1U_NACKERR_MASK                   equ 0004h
C1BDIAG1U_NFORMERR_POSN                  equ 0003h
C1BDIAG1U_NFORMERR_POSITION              equ 0003h
C1BDIAG1U_NFORMERR_SIZE                  equ 0001h
C1BDIAG1U_NFORMERR_LENGTH                equ 0001h
C1BDIAG1U_NFORMERR_MASK                  equ 0008h
C1BDIAG1U_NSTUFERR_POSN                  equ 0004h
C1BDIAG1U_NSTUFERR_POSITION              equ 0004h
C1BDIAG1U_NSTUFERR_SIZE                  equ 0001h
C1BDIAG1U_NSTUFERR_LENGTH                equ 0001h
C1BDIAG1U_NSTUFERR_MASK                  equ 0010h
C1BDIAG1U_NCRCERR_POSN                   equ 0005h
C1BDIAG1U_NCRCERR_POSITION               equ 0005h
C1BDIAG1U_NCRCERR_SIZE                   equ 0001h
C1BDIAG1U_NCRCERR_LENGTH                 equ 0001h
C1BDIAG1U_NCRCERR_MASK                   equ 0020h
C1BDIAG1U_TXBOERR_POSN                   equ 0007h
C1BDIAG1U_TXBOERR_POSITION               equ 0007h
C1BDIAG1U_TXBOERR_SIZE                   equ 0001h
C1BDIAG1U_TXBOERR_LENGTH                 equ 0001h
C1BDIAG1U_TXBOERR_MASK                   equ 0080h

// Register: C1BDIAG1T
#define C1BDIAG1T C1BDIAG1T
C1BDIAG1T                                equ 013Fh
// bitfield definitions
C1BDIAG1T_DBIT0ERR_POSN                  equ 0000h
C1BDIAG1T_DBIT0ERR_POSITION              equ 0000h
C1BDIAG1T_DBIT0ERR_SIZE                  equ 0001h
C1BDIAG1T_DBIT0ERR_LENGTH                equ 0001h
C1BDIAG1T_DBIT0ERR_MASK                  equ 0001h
C1BDIAG1T_DBIT1ERR_POSN                  equ 0001h
C1BDIAG1T_DBIT1ERR_POSITION              equ 0001h
C1BDIAG1T_DBIT1ERR_SIZE                  equ 0001h
C1BDIAG1T_DBIT1ERR_LENGTH                equ 0001h
C1BDIAG1T_DBIT1ERR_MASK                  equ 0002h
C1BDIAG1T_DFORMERR_POSN                  equ 0003h
C1BDIAG1T_DFORMERR_POSITION              equ 0003h
C1BDIAG1T_DFORMERR_SIZE                  equ 0001h
C1BDIAG1T_DFORMERR_LENGTH                equ 0001h
C1BDIAG1T_DFORMERR_MASK                  equ 0008h
C1BDIAG1T_DSTUFERR_POSN                  equ 0004h
C1BDIAG1T_DSTUFERR_POSITION              equ 0004h
C1BDIAG1T_DSTUFERR_SIZE                  equ 0001h
C1BDIAG1T_DSTUFERR_LENGTH                equ 0001h
C1BDIAG1T_DSTUFERR_MASK                  equ 0010h
C1BDIAG1T_DCRCERR_POSN                   equ 0005h
C1BDIAG1T_DCRCERR_POSITION               equ 0005h
C1BDIAG1T_DCRCERR_SIZE                   equ 0001h
C1BDIAG1T_DCRCERR_LENGTH                 equ 0001h
C1BDIAG1T_DCRCERR_MASK                   equ 0020h
C1BDIAG1T_ESI_POSN                       equ 0006h
C1BDIAG1T_ESI_POSITION                   equ 0006h
C1BDIAG1T_ESI_SIZE                       equ 0001h
C1BDIAG1T_ESI_LENGTH                     equ 0001h
C1BDIAG1T_ESI_MASK                       equ 0040h
C1BDIAG1T_DLCMM_POSN                     equ 0007h
C1BDIAG1T_DLCMM_POSITION                 equ 0007h
C1BDIAG1T_DLCMM_SIZE                     equ 0001h
C1BDIAG1T_DLCMM_LENGTH                   equ 0001h
C1BDIAG1T_DLCMM_MASK                     equ 0080h

// Register: C1TEFCONL
#define C1TEFCONL C1TEFCONL
C1TEFCONL                                equ 0140h
// bitfield definitions
C1TEFCONL_TEFNEIE_POSN                   equ 0000h
C1TEFCONL_TEFNEIE_POSITION               equ 0000h
C1TEFCONL_TEFNEIE_SIZE                   equ 0001h
C1TEFCONL_TEFNEIE_LENGTH                 equ 0001h
C1TEFCONL_TEFNEIE_MASK                   equ 0001h
C1TEFCONL_TEFHIE_POSN                    equ 0001h
C1TEFCONL_TEFHIE_POSITION                equ 0001h
C1TEFCONL_TEFHIE_SIZE                    equ 0001h
C1TEFCONL_TEFHIE_LENGTH                  equ 0001h
C1TEFCONL_TEFHIE_MASK                    equ 0002h
C1TEFCONL_TEFFIE_POSN                    equ 0002h
C1TEFCONL_TEFFIE_POSITION                equ 0002h
C1TEFCONL_TEFFIE_SIZE                    equ 0001h
C1TEFCONL_TEFFIE_LENGTH                  equ 0001h
C1TEFCONL_TEFFIE_MASK                    equ 0004h
C1TEFCONL_TEFOVIE_POSN                   equ 0003h
C1TEFCONL_TEFOVIE_POSITION               equ 0003h
C1TEFCONL_TEFOVIE_SIZE                   equ 0001h
C1TEFCONL_TEFOVIE_LENGTH                 equ 0001h
C1TEFCONL_TEFOVIE_MASK                   equ 0008h
C1TEFCONL_TEFTSEN_POSN                   equ 0005h
C1TEFCONL_TEFTSEN_POSITION               equ 0005h
C1TEFCONL_TEFTSEN_SIZE                   equ 0001h
C1TEFCONL_TEFTSEN_LENGTH                 equ 0001h
C1TEFCONL_TEFTSEN_MASK                   equ 0020h

// Register: C1TEFCONH
#define C1TEFCONH C1TEFCONH
C1TEFCONH                                equ 0141h
// bitfield definitions
C1TEFCONH_UINC_POSN                      equ 0000h
C1TEFCONH_UINC_POSITION                  equ 0000h
C1TEFCONH_UINC_SIZE                      equ 0001h
C1TEFCONH_UINC_LENGTH                    equ 0001h
C1TEFCONH_UINC_MASK                      equ 0001h
C1TEFCONH_FRESET_POSN                    equ 0002h
C1TEFCONH_FRESET_POSITION                equ 0002h
C1TEFCONH_FRESET_SIZE                    equ 0001h
C1TEFCONH_FRESET_LENGTH                  equ 0001h
C1TEFCONH_FRESET_MASK                    equ 0004h

// Register: C1TEFCONU
#define C1TEFCONU C1TEFCONU
C1TEFCONU                                equ 0142h

