GopalSaraf/Practicals/PSDL/include/proc/pic18f46q84.inc
// Register: C1FLTCON1H
#define C1FLTCON1H C1FLTCON1H
C1FLTCON1H                               equ 0185h
// bitfield definitions
C1FLTCON1H_F5BP_POSN                     equ 0000h
C1FLTCON1H_F5BP_POSITION                 equ 0000h
C1FLTCON1H_F5BP_SIZE                     equ 0005h
C1FLTCON1H_F5BP_LENGTH                   equ 0005h
C1FLTCON1H_F5BP_MASK                     equ 001Fh
C1FLTCON1H_FLTEN5_POSN                   equ 0007h
C1FLTCON1H_FLTEN5_POSITION               equ 0007h
C1FLTCON1H_FLTEN5_SIZE                   equ 0001h
C1FLTCON1H_FLTEN5_LENGTH                 equ 0001h
C1FLTCON1H_FLTEN5_MASK                   equ 0080h
C1FLTCON1H_F5BP0_POSN                    equ 0000h
C1FLTCON1H_F5BP0_POSITION                equ 0000h
C1FLTCON1H_F5BP0_SIZE                    equ 0001h
C1FLTCON1H_F5BP0_LENGTH                  equ 0001h
C1FLTCON1H_F5BP0_MASK                    equ 0001h
C1FLTCON1H_F5BP1_POSN                    equ 0001h
C1FLTCON1H_F5BP1_POSITION                equ 0001h
C1FLTCON1H_F5BP1_SIZE                    equ 0001h
C1FLTCON1H_F5BP1_LENGTH                  equ 0001h
C1FLTCON1H_F5BP1_MASK                    equ 0002h
C1FLTCON1H_F5BP2_POSN                    equ 0002h
C1FLTCON1H_F5BP2_POSITION                equ 0002h
C1FLTCON1H_F5BP2_SIZE                    equ 0001h
C1FLTCON1H_F5BP2_LENGTH                  equ 0001h
C1FLTCON1H_F5BP2_MASK                    equ 0004h
C1FLTCON1H_F5BP3_POSN                    equ 0003h
C1FLTCON1H_F5BP3_POSITION                equ 0003h
C1FLTCON1H_F5BP3_SIZE                    equ 0001h
C1FLTCON1H_F5BP3_LENGTH                  equ 0001h
C1FLTCON1H_F5BP3_MASK                    equ 0008h
C1FLTCON1H_F5BP4_POSN                    equ 0004h
C1FLTCON1H_F5BP4_POSITION                equ 0004h
C1FLTCON1H_F5BP4_SIZE                    equ 0001h
C1FLTCON1H_F5BP4_LENGTH                  equ 0001h
C1FLTCON1H_F5BP4_MASK                    equ 0010h

// Register: C1FLTCON1U
#define C1FLTCON1U C1FLTCON1U
C1FLTCON1U                               equ 0186h
// bitfield definitions
C1FLTCON1U_F6BP_POSN                     equ 0000h
C1FLTCON1U_F6BP_POSITION                 equ 0000h
C1FLTCON1U_F6BP_SIZE                     equ 0005h
C1FLTCON1U_F6BP_LENGTH                   equ 0005h
C1FLTCON1U_F6BP_MASK                     equ 001Fh
C1FLTCON1U_FLTEN6_POSN                   equ 0007h
C1FLTCON1U_FLTEN6_POSITION               equ 0007h
C1FLTCON1U_FLTEN6_SIZE                   equ 0001h
C1FLTCON1U_FLTEN6_LENGTH                 equ 0001h
C1FLTCON1U_FLTEN6_MASK                   equ 0080h
C1FLTCON1U_F6BP0_POSN                    equ 0000h
C1FLTCON1U_F6BP0_POSITION                equ 0000h
C1FLTCON1U_F6BP0_SIZE                    equ 0001h
C1FLTCON1U_F6BP0_LENGTH                  equ 0001h
C1FLTCON1U_F6BP0_MASK                    equ 0001h
C1FLTCON1U_F6BP1_POSN                    equ 0001h
C1FLTCON1U_F6BP1_POSITION                equ 0001h
C1FLTCON1U_F6BP1_SIZE                    equ 0001h
C1FLTCON1U_F6BP1_LENGTH                  equ 0001h
C1FLTCON1U_F6BP1_MASK                    equ 0002h
C1FLTCON1U_F6BP2_POSN                    equ 0002h
C1FLTCON1U_F6BP2_POSITION                equ 0002h
C1FLTCON1U_F6BP2_SIZE                    equ 0001h
C1FLTCON1U_F6BP2_LENGTH                  equ 0001h
C1FLTCON1U_F6BP2_MASK                    equ 0004h
C1FLTCON1U_F6BP3_POSN                    equ 0003h
C1FLTCON1U_F6BP3_POSITION                equ 0003h
C1FLTCON1U_F6BP3_SIZE                    equ 0001h
C1FLTCON1U_F6BP3_LENGTH                  equ 0001h
C1FLTCON1U_F6BP3_MASK                    equ 0008h
C1FLTCON1U_F6BP4_POSN                    equ 0004h
C1FLTCON1U_F6BP4_POSITION                equ 0004h
C1FLTCON1U_F6BP4_SIZE                    equ 0001h
C1FLTCON1U_F6BP4_LENGTH                  equ 0001h
C1FLTCON1U_F6BP4_MASK                    equ 0010h

// Register: C1FLTCON1T
#define C1FLTCON1T C1FLTCON1T
C1FLTCON1T                               equ 0187h
// bitfield definitions
C1FLTCON1T_F7BP_POSN                     equ 0000h
C1FLTCON1T_F7BP_POSITION                 equ 0000h
C1FLTCON1T_F7BP_SIZE                     equ 0005h
C1FLTCON1T_F7BP_LENGTH                   equ 0005h
C1FLTCON1T_F7BP_MASK                     equ 001Fh
C1FLTCON1T_FLTEN7_POSN                   equ 0007h
C1FLTCON1T_FLTEN7_POSITION               equ 0007h
C1FLTCON1T_FLTEN7_SIZE                   equ 0001h
C1FLTCON1T_FLTEN7_LENGTH                 equ 0001h
C1FLTCON1T_FLTEN7_MASK                   equ 0080h
C1FLTCON1T_F7BP0_POSN                    equ 0000h
C1FLTCON1T_F7BP0_POSITION                equ 0000h
C1FLTCON1T_F7BP0_SIZE                    equ 0001h
C1FLTCON1T_F7BP0_LENGTH                  equ 0001h
C1FLTCON1T_F7BP0_MASK                    equ 0001h
C1FLTCON1T_F7BP1_POSN                    equ 0001h
C1FLTCON1T_F7BP1_POSITION                equ 0001h
C1FLTCON1T_F7BP1_SIZE                    equ 0001h
C1FLTCON1T_F7BP1_LENGTH                  equ 0001h
C1FLTCON1T_F7BP1_MASK                    equ 0002h
C1FLTCON1T_F7BP2_POSN                    equ 0002h
C1FLTCON1T_F7BP2_POSITION                equ 0002h
C1FLTCON1T_F7BP2_SIZE                    equ 0001h
C1FLTCON1T_F7BP2_LENGTH                  equ 0001h
C1FLTCON1T_F7BP2_MASK                    equ 0004h
C1FLTCON1T_F7BP3_POSN                    equ 0003h
C1FLTCON1T_F7BP3_POSITION                equ 0003h
C1FLTCON1T_F7BP3_SIZE                    equ 0001h
C1FLTCON1T_F7BP3_LENGTH                  equ 0001h
C1FLTCON1T_F7BP3_MASK                    equ 0008h
C1FLTCON1T_F7BP4_POSN                    equ 0004h
C1FLTCON1T_F7BP4_POSITION                equ 0004h
C1FLTCON1T_F7BP4_SIZE                    equ 0001h
C1FLTCON1T_F7BP4_LENGTH                  equ 0001h
C1FLTCON1T_F7BP4_MASK                    equ 0010h

// Register: C1FLTCON2L
#define C1FLTCON2L C1FLTCON2L
C1FLTCON2L                               equ 0188h
// bitfield definitions
C1FLTCON2L_F8BP_POSN                     equ 0000h
C1FLTCON2L_F8BP_POSITION                 equ 0000h
C1FLTCON2L_F8BP_SIZE                     equ 0005h
C1FLTCON2L_F8BP_LENGTH                   equ 0005h
C1FLTCON2L_F8BP_MASK                     equ 001Fh
C1FLTCON2L_FLTEN8_POSN                   equ 0007h
C1FLTCON2L_FLTEN8_POSITION               equ 0007h
C1FLTCON2L_FLTEN8_SIZE                   equ 0001h
C1FLTCON2L_FLTEN8_LENGTH                 equ 0001h
C1FLTCON2L_FLTEN8_MASK                   equ 0080h
C1FLTCON2L_F8BP0_POSN                    equ 0000h
C1FLTCON2L_F8BP0_POSITION                equ 0000h
C1FLTCON2L_F8BP0_SIZE                    equ 0001h
C1FLTCON2L_F8BP0_LENGTH                  equ 0001h
C1FLTCON2L_F8BP0_MASK                    equ 0001h
C1FLTCON2L_F8BP1_POSN                    equ 0001h
C1FLTCON2L_F8BP1_POSITION                equ 0001h
C1FLTCON2L_F8BP1_SIZE                    equ 0001h
C1FLTCON2L_F8BP1_LENGTH                  equ 0001h
C1FLTCON2L_F8BP1_MASK                    equ 0002h
C1FLTCON2L_F8BP2_POSN                    equ 0002h
C1FLTCON2L_F8BP2_POSITION                equ 0002h
C1FLTCON2L_F8BP2_SIZE                    equ 0001h
C1FLTCON2L_F8BP2_LENGTH                  equ 0001h
C1FLTCON2L_F8BP2_MASK                    equ 0004h
C1FLTCON2L_F8BP3_POSN                    equ 0003h
C1FLTCON2L_F8BP3_POSITION                equ 0003h
C1FLTCON2L_F8BP3_SIZE                    equ 0001h
C1FLTCON2L_F8BP3_LENGTH                  equ 0001h
C1FLTCON2L_F8BP3_MASK                    equ 0008h
C1FLTCON2L_F8BP4_POSN                    equ 0004h
C1FLTCON2L_F8BP4_POSITION                equ 0004h
C1FLTCON2L_F8BP4_SIZE                    equ 0001h
C1FLTCON2L_F8BP4_LENGTH                  equ 0001h
C1FLTCON2L_F8BP4_MASK                    equ 0010h

// Register: C1FLTCON2H
#define C1FLTCON2H C1FLTCON2H
C1FLTCON2H                               equ 0189h
// bitfield definitions
C1FLTCON2H_F9BP_POSN                     equ 0000h
C1FLTCON2H_F9BP_POSITION                 equ 0000h
C1FLTCON2H_F9BP_SIZE                     equ 0005h
C1FLTCON2H_F9BP_LENGTH                   equ 0005h
C1FLTCON2H_F9BP_MASK                     equ 001Fh
C1FLTCON2H_FLTEN9_POSN                   equ 0007h
C1FLTCON2H_FLTEN9_POSITION               equ 0007h
C1FLTCON2H_FLTEN9_SIZE                   equ 0001h
C1FLTCON2H_FLTEN9_LENGTH                 equ 0001h
C1FLTCON2H_FLTEN9_MASK                   equ 0080h
C1FLTCON2H_F9BP0_POSN                    equ 0000h
C1FLTCON2H_F9BP0_POSITION                equ 0000h
C1FLTCON2H_F9BP0_SIZE                    equ 0001h
C1FLTCON2H_F9BP0_LENGTH                  equ 0001h
C1FLTCON2H_F9BP0_MASK                    equ 0001h
C1FLTCON2H_F9BP1_POSN                    equ 0001h
C1FLTCON2H_F9BP1_POSITION                equ 0001h
C1FLTCON2H_F9BP1_SIZE                    equ 0001h
C1FLTCON2H_F9BP1_LENGTH                  equ 0001h
C1FLTCON2H_F9BP1_MASK                    equ 0002h
C1FLTCON2H_F9BP2_POSN                    equ 0002h
C1FLTCON2H_F9BP2_POSITION                equ 0002h
C1FLTCON2H_F9BP2_SIZE                    equ 0001h
C1FLTCON2H_F9BP2_LENGTH                  equ 0001h
C1FLTCON2H_F9BP2_MASK                    equ 0004h
C1FLTCON2H_F9BP3_POSN                    equ 0003h
C1FLTCON2H_F9BP3_POSITION                equ 0003h
C1FLTCON2H_F9BP3_SIZE                    equ 0001h
C1FLTCON2H_F9BP3_LENGTH                  equ 0001h
C1FLTCON2H_F9BP3_MASK                    equ 0008h
C1FLTCON2H_F9BP4_POSN                    equ 0004h
C1FLTCON2H_F9BP4_POSITION                equ 0004h
C1FLTCON2H_F9BP4_SIZE                    equ 0001h
C1FLTCON2H_F9BP4_LENGTH                  equ 0001h
C1FLTCON2H_F9BP4_MASK                    equ 0010h

// Register: C1FLTCON2U
#define C1FLTCON2U C1FLTCON2U
C1FLTCON2U                               equ 018Ah
// bitfield definitions
C1FLTCON2U_F10BP_POSN                    equ 0000h
C1FLTCON2U_F10BP_POSITION                equ 0000h
C1FLTCON2U_F10BP_SIZE                    equ 0005h
C1FLTCON2U_F10BP_LENGTH                  equ 0005h
C1FLTCON2U_F10BP_MASK                    equ 001Fh
C1FLTCON2U_FLTEN10_POSN                  equ 0007h
C1FLTCON2U_FLTEN10_POSITION              equ 0007h
C1FLTCON2U_FLTEN10_SIZE                  equ 0001h
C1FLTCON2U_FLTEN10_LENGTH                equ 0001h
C1FLTCON2U_FLTEN10_MASK                  equ 0080h
C1FLTCON2U_F10BP0_POSN                   equ 0000h
C1FLTCON2U_F10BP0_POSITION               equ 0000h
C1FLTCON2U_F10BP0_SIZE                   equ 0001h
C1FLTCON2U_F10BP0_LENGTH                 equ 0001h
C1FLTCON2U_F10BP0_MASK                   equ 0001h
C1FLTCON2U_F10BP1_POSN                   equ 0001h
C1FLTCON2U_F10BP1_POSITION               equ 0001h
C1FLTCON2U_F10BP1_SIZE                   equ 0001h
C1FLTCON2U_F10BP1_LENGTH                 equ 0001h
C1FLTCON2U_F10BP1_MASK                   equ 0002h
C1FLTCON2U_F10BP2_POSN                   equ 0002h
C1FLTCON2U_F10BP2_POSITION               equ 0002h
C1FLTCON2U_F10BP2_SIZE                   equ 0001h
C1FLTCON2U_F10BP2_LENGTH                 equ 0001h
C1FLTCON2U_F10BP2_MASK                   equ 0004h
C1FLTCON2U_F10BP3_POSN                   equ 0003h
C1FLTCON2U_F10BP3_POSITION               equ 0003h
C1FLTCON2U_F10BP3_SIZE                   equ 0001h
C1FLTCON2U_F10BP3_LENGTH                 equ 0001h
C1FLTCON2U_F10BP3_MASK                   equ 0008h
C1FLTCON2U_F10BP4_POSN                   equ 0004h
C1FLTCON2U_F10BP4_POSITION               equ 0004h
C1FLTCON2U_F10BP4_SIZE                   equ 0001h
C1FLTCON2U_F10BP4_LENGTH                 equ 0001h
C1FLTCON2U_F10BP4_MASK                   equ 0010h

