GopalSaraf/Practicals/PSDL/include/proc/pic18f46q84.inc
// Register: RD3PPS
#define RD3PPS RD3PPS
RD3PPS                                   equ 021Ch
// bitfield definitions
RD3PPS_RD3PPS0_POSN                      equ 0000h
RD3PPS_RD3PPS0_POSITION                  equ 0000h
RD3PPS_RD3PPS0_SIZE                      equ 0001h
RD3PPS_RD3PPS0_LENGTH                    equ 0001h
RD3PPS_RD3PPS0_MASK                      equ 0001h
RD3PPS_RD3PPS1_POSN                      equ 0001h
RD3PPS_RD3PPS1_POSITION                  equ 0001h
RD3PPS_RD3PPS1_SIZE                      equ 0001h
RD3PPS_RD3PPS1_LENGTH                    equ 0001h
RD3PPS_RD3PPS1_MASK                      equ 0002h
RD3PPS_RD3PPS2_POSN                      equ 0002h
RD3PPS_RD3PPS2_POSITION                  equ 0002h
RD3PPS_RD3PPS2_SIZE                      equ 0001h
RD3PPS_RD3PPS2_LENGTH                    equ 0001h
RD3PPS_RD3PPS2_MASK                      equ 0004h
RD3PPS_RD3PPS3_POSN                      equ 0003h
RD3PPS_RD3PPS3_POSITION                  equ 0003h
RD3PPS_RD3PPS3_SIZE                      equ 0001h
RD3PPS_RD3PPS3_LENGTH                    equ 0001h
RD3PPS_RD3PPS3_MASK                      equ 0008h
RD3PPS_RD3PPS4_POSN                      equ 0004h
RD3PPS_RD3PPS4_POSITION                  equ 0004h
RD3PPS_RD3PPS4_SIZE                      equ 0001h
RD3PPS_RD3PPS4_LENGTH                    equ 0001h
RD3PPS_RD3PPS4_MASK                      equ 0010h
RD3PPS_RD3PPS5_POSN                      equ 0005h
RD3PPS_RD3PPS5_POSITION                  equ 0005h
RD3PPS_RD3PPS5_SIZE                      equ 0001h
RD3PPS_RD3PPS5_LENGTH                    equ 0001h
RD3PPS_RD3PPS5_MASK                      equ 0020h

// Register: RD4PPS
#define RD4PPS RD4PPS
RD4PPS                                   equ 021Dh
// bitfield definitions
RD4PPS_RD4PPS0_POSN                      equ 0000h
RD4PPS_RD4PPS0_POSITION                  equ 0000h
RD4PPS_RD4PPS0_SIZE                      equ 0001h
RD4PPS_RD4PPS0_LENGTH                    equ 0001h
RD4PPS_RD4PPS0_MASK                      equ 0001h
RD4PPS_RD4PPS1_POSN                      equ 0001h
RD4PPS_RD4PPS1_POSITION                  equ 0001h
RD4PPS_RD4PPS1_SIZE                      equ 0001h
RD4PPS_RD4PPS1_LENGTH                    equ 0001h
RD4PPS_RD4PPS1_MASK                      equ 0002h
RD4PPS_RD4PPS2_POSN                      equ 0002h
RD4PPS_RD4PPS2_POSITION                  equ 0002h
RD4PPS_RD4PPS2_SIZE                      equ 0001h
RD4PPS_RD4PPS2_LENGTH                    equ 0001h
RD4PPS_RD4PPS2_MASK                      equ 0004h
RD4PPS_RD4PPS3_POSN                      equ 0003h
RD4PPS_RD4PPS3_POSITION                  equ 0003h
RD4PPS_RD4PPS3_SIZE                      equ 0001h
RD4PPS_RD4PPS3_LENGTH                    equ 0001h
RD4PPS_RD4PPS3_MASK                      equ 0008h
RD4PPS_RD4PPS4_POSN                      equ 0004h
RD4PPS_RD4PPS4_POSITION                  equ 0004h
RD4PPS_RD4PPS4_SIZE                      equ 0001h
RD4PPS_RD4PPS4_LENGTH                    equ 0001h
RD4PPS_RD4PPS4_MASK                      equ 0010h
RD4PPS_RD4PPS5_POSN                      equ 0005h
RD4PPS_RD4PPS5_POSITION                  equ 0005h
RD4PPS_RD4PPS5_SIZE                      equ 0001h
RD4PPS_RD4PPS5_LENGTH                    equ 0001h
RD4PPS_RD4PPS5_MASK                      equ 0020h

// Register: RD5PPS
#define RD5PPS RD5PPS
RD5PPS                                   equ 021Eh
// bitfield definitions
RD5PPS_RD5PPS0_POSN                      equ 0000h
RD5PPS_RD5PPS0_POSITION                  equ 0000h
RD5PPS_RD5PPS0_SIZE                      equ 0001h
RD5PPS_RD5PPS0_LENGTH                    equ 0001h
RD5PPS_RD5PPS0_MASK                      equ 0001h
RD5PPS_RD5PPS1_POSN                      equ 0001h
RD5PPS_RD5PPS1_POSITION                  equ 0001h
RD5PPS_RD5PPS1_SIZE                      equ 0001h
RD5PPS_RD5PPS1_LENGTH                    equ 0001h
RD5PPS_RD5PPS1_MASK                      equ 0002h
RD5PPS_RD5PPS2_POSN                      equ 0002h
RD5PPS_RD5PPS2_POSITION                  equ 0002h
RD5PPS_RD5PPS2_SIZE                      equ 0001h
RD5PPS_RD5PPS2_LENGTH                    equ 0001h
RD5PPS_RD5PPS2_MASK                      equ 0004h
RD5PPS_RD5PPS3_POSN                      equ 0003h
RD5PPS_RD5PPS3_POSITION                  equ 0003h
RD5PPS_RD5PPS3_SIZE                      equ 0001h
RD5PPS_RD5PPS3_LENGTH                    equ 0001h
RD5PPS_RD5PPS3_MASK                      equ 0008h
RD5PPS_RD5PPS4_POSN                      equ 0004h
RD5PPS_RD5PPS4_POSITION                  equ 0004h
RD5PPS_RD5PPS4_SIZE                      equ 0001h
RD5PPS_RD5PPS4_LENGTH                    equ 0001h
RD5PPS_RD5PPS4_MASK                      equ 0010h
RD5PPS_RD5PPS5_POSN                      equ 0005h
RD5PPS_RD5PPS5_POSITION                  equ 0005h
RD5PPS_RD5PPS5_SIZE                      equ 0001h
RD5PPS_RD5PPS5_LENGTH                    equ 0001h
RD5PPS_RD5PPS5_MASK                      equ 0020h

// Register: RD6PPS
#define RD6PPS RD6PPS
RD6PPS                                   equ 021Fh
// bitfield definitions
RD6PPS_RD6PPS0_POSN                      equ 0000h
RD6PPS_RD6PPS0_POSITION                  equ 0000h
RD6PPS_RD6PPS0_SIZE                      equ 0001h
RD6PPS_RD6PPS0_LENGTH                    equ 0001h
RD6PPS_RD6PPS0_MASK                      equ 0001h
RD6PPS_RD6PPS1_POSN                      equ 0001h
RD6PPS_RD6PPS1_POSITION                  equ 0001h
RD6PPS_RD6PPS1_SIZE                      equ 0001h
RD6PPS_RD6PPS1_LENGTH                    equ 0001h
RD6PPS_RD6PPS1_MASK                      equ 0002h
RD6PPS_RD6PPS2_POSN                      equ 0002h
RD6PPS_RD6PPS2_POSITION                  equ 0002h
RD6PPS_RD6PPS2_SIZE                      equ 0001h
RD6PPS_RD6PPS2_LENGTH                    equ 0001h
RD6PPS_RD6PPS2_MASK                      equ 0004h
RD6PPS_RD6PPS3_POSN                      equ 0003h
RD6PPS_RD6PPS3_POSITION                  equ 0003h
RD6PPS_RD6PPS3_SIZE                      equ 0001h
RD6PPS_RD6PPS3_LENGTH                    equ 0001h
RD6PPS_RD6PPS3_MASK                      equ 0008h
RD6PPS_RD6PPS4_POSN                      equ 0004h
RD6PPS_RD6PPS4_POSITION                  equ 0004h
RD6PPS_RD6PPS4_SIZE                      equ 0001h
RD6PPS_RD6PPS4_LENGTH                    equ 0001h
RD6PPS_RD6PPS4_MASK                      equ 0010h
RD6PPS_RD6PPS5_POSN                      equ 0005h
RD6PPS_RD6PPS5_POSITION                  equ 0005h
RD6PPS_RD6PPS5_SIZE                      equ 0001h
RD6PPS_RD6PPS5_LENGTH                    equ 0001h
RD6PPS_RD6PPS5_MASK                      equ 0020h

// Register: RD7PPS
#define RD7PPS RD7PPS
RD7PPS                                   equ 0220h
// bitfield definitions
RD7PPS_RD7PPS0_POSN                      equ 0000h
RD7PPS_RD7PPS0_POSITION                  equ 0000h
RD7PPS_RD7PPS0_SIZE                      equ 0001h
RD7PPS_RD7PPS0_LENGTH                    equ 0001h
RD7PPS_RD7PPS0_MASK                      equ 0001h
RD7PPS_RD7PPS1_POSN                      equ 0001h
RD7PPS_RD7PPS1_POSITION                  equ 0001h
RD7PPS_RD7PPS1_SIZE                      equ 0001h
RD7PPS_RD7PPS1_LENGTH                    equ 0001h
RD7PPS_RD7PPS1_MASK                      equ 0002h
RD7PPS_RD7PPS2_POSN                      equ 0002h
RD7PPS_RD7PPS2_POSITION                  equ 0002h
RD7PPS_RD7PPS2_SIZE                      equ 0001h
RD7PPS_RD7PPS2_LENGTH                    equ 0001h
RD7PPS_RD7PPS2_MASK                      equ 0004h
RD7PPS_RD7PPS3_POSN                      equ 0003h
RD7PPS_RD7PPS3_POSITION                  equ 0003h
RD7PPS_RD7PPS3_SIZE                      equ 0001h
RD7PPS_RD7PPS3_LENGTH                    equ 0001h
RD7PPS_RD7PPS3_MASK                      equ 0008h
RD7PPS_RD7PPS4_POSN                      equ 0004h
RD7PPS_RD7PPS4_POSITION                  equ 0004h
RD7PPS_RD7PPS4_SIZE                      equ 0001h
RD7PPS_RD7PPS4_LENGTH                    equ 0001h
RD7PPS_RD7PPS4_MASK                      equ 0010h
RD7PPS_RD7PPS5_POSN                      equ 0005h
RD7PPS_RD7PPS5_POSITION                  equ 0005h
RD7PPS_RD7PPS5_SIZE                      equ 0001h
RD7PPS_RD7PPS5_LENGTH                    equ 0001h
RD7PPS_RD7PPS5_MASK                      equ 0020h

// Register: RE0PPS
#define RE0PPS RE0PPS
RE0PPS                                   equ 0221h
// bitfield definitions
RE0PPS_RE0PPS0_POSN                      equ 0000h
RE0PPS_RE0PPS0_POSITION                  equ 0000h
RE0PPS_RE0PPS0_SIZE                      equ 0001h
RE0PPS_RE0PPS0_LENGTH                    equ 0001h
RE0PPS_RE0PPS0_MASK                      equ 0001h
RE0PPS_RE0PPS1_POSN                      equ 0001h
RE0PPS_RE0PPS1_POSITION                  equ 0001h
RE0PPS_RE0PPS1_SIZE                      equ 0001h
RE0PPS_RE0PPS1_LENGTH                    equ 0001h
RE0PPS_RE0PPS1_MASK                      equ 0002h
RE0PPS_RE0PPS2_POSN                      equ 0002h
RE0PPS_RE0PPS2_POSITION                  equ 0002h
RE0PPS_RE0PPS2_SIZE                      equ 0001h
RE0PPS_RE0PPS2_LENGTH                    equ 0001h
RE0PPS_RE0PPS2_MASK                      equ 0004h
RE0PPS_RE0PPS3_POSN                      equ 0003h
RE0PPS_RE0PPS3_POSITION                  equ 0003h
RE0PPS_RE0PPS3_SIZE                      equ 0001h
RE0PPS_RE0PPS3_LENGTH                    equ 0001h
RE0PPS_RE0PPS3_MASK                      equ 0008h
RE0PPS_RE0PPS4_POSN                      equ 0004h
RE0PPS_RE0PPS4_POSITION                  equ 0004h
RE0PPS_RE0PPS4_SIZE                      equ 0001h
RE0PPS_RE0PPS4_LENGTH                    equ 0001h
RE0PPS_RE0PPS4_MASK                      equ 0010h
RE0PPS_RE0PPS5_POSN                      equ 0005h
RE0PPS_RE0PPS5_POSITION                  equ 0005h
RE0PPS_RE0PPS5_SIZE                      equ 0001h
RE0PPS_RE0PPS5_LENGTH                    equ 0001h
RE0PPS_RE0PPS5_MASK                      equ 0020h

// Register: RE1PPS
#define RE1PPS RE1PPS
RE1PPS                                   equ 0222h
// bitfield definitions
RE1PPS_RE1PPS0_POSN                      equ 0000h
RE1PPS_RE1PPS0_POSITION                  equ 0000h
RE1PPS_RE1PPS0_SIZE                      equ 0001h
RE1PPS_RE1PPS0_LENGTH                    equ 0001h
RE1PPS_RE1PPS0_MASK                      equ 0001h
RE1PPS_RE1PPS1_POSN                      equ 0001h
RE1PPS_RE1PPS1_POSITION                  equ 0001h
RE1PPS_RE1PPS1_SIZE                      equ 0001h
RE1PPS_RE1PPS1_LENGTH                    equ 0001h
RE1PPS_RE1PPS1_MASK                      equ 0002h
RE1PPS_RE1PPS2_POSN                      equ 0002h
RE1PPS_RE1PPS2_POSITION                  equ 0002h
RE1PPS_RE1PPS2_SIZE                      equ 0001h
RE1PPS_RE1PPS2_LENGTH                    equ 0001h
RE1PPS_RE1PPS2_MASK                      equ 0004h
RE1PPS_RE1PPS3_POSN                      equ 0003h
RE1PPS_RE1PPS3_POSITION                  equ 0003h
RE1PPS_RE1PPS3_SIZE                      equ 0001h
RE1PPS_RE1PPS3_LENGTH                    equ 0001h
RE1PPS_RE1PPS3_MASK                      equ 0008h
RE1PPS_RE1PPS4_POSN                      equ 0004h
RE1PPS_RE1PPS4_POSITION                  equ 0004h
RE1PPS_RE1PPS4_SIZE                      equ 0001h
RE1PPS_RE1PPS4_LENGTH                    equ 0001h
RE1PPS_RE1PPS4_MASK                      equ 0010h
RE1PPS_RE1PPS5_POSN                      equ 0005h
RE1PPS_RE1PPS5_POSITION                  equ 0005h
RE1PPS_RE1PPS5_SIZE                      equ 0001h
RE1PPS_RE1PPS5_LENGTH                    equ 0001h
RE1PPS_RE1PPS5_MASK                      equ 0020h

// Register: RE2PPS
#define RE2PPS RE2PPS
RE2PPS                                   equ 0223h
// bitfield definitions
RE2PPS_RE2PPS0_POSN                      equ 0000h
RE2PPS_RE2PPS0_POSITION                  equ 0000h
RE2PPS_RE2PPS0_SIZE                      equ 0001h
RE2PPS_RE2PPS0_LENGTH                    equ 0001h
RE2PPS_RE2PPS0_MASK                      equ 0001h
RE2PPS_RE2PPS1_POSN                      equ 0001h
RE2PPS_RE2PPS1_POSITION                  equ 0001h
RE2PPS_RE2PPS1_SIZE                      equ 0001h
RE2PPS_RE2PPS1_LENGTH                    equ 0001h
RE2PPS_RE2PPS1_MASK                      equ 0002h
RE2PPS_RE2PPS2_POSN                      equ 0002h
RE2PPS_RE2PPS2_POSITION                  equ 0002h
RE2PPS_RE2PPS2_SIZE                      equ 0001h
RE2PPS_RE2PPS2_LENGTH                    equ 0001h
RE2PPS_RE2PPS2_MASK                      equ 0004h
RE2PPS_RE2PPS3_POSN                      equ 0003h
RE2PPS_RE2PPS3_POSITION                  equ 0003h
RE2PPS_RE2PPS3_SIZE                      equ 0001h
RE2PPS_RE2PPS3_LENGTH                    equ 0001h
RE2PPS_RE2PPS3_MASK                      equ 0008h
RE2PPS_RE2PPS4_POSN                      equ 0004h
RE2PPS_RE2PPS4_POSITION                  equ 0004h
RE2PPS_RE2PPS4_SIZE                      equ 0001h
RE2PPS_RE2PPS4_LENGTH                    equ 0001h
RE2PPS_RE2PPS4_MASK                      equ 0010h
RE2PPS_RE2PPS5_POSN                      equ 0005h
RE2PPS_RE2PPS5_POSITION                  equ 0005h
RE2PPS_RE2PPS5_SIZE                      equ 0001h
RE2PPS_RE2PPS5_LENGTH                    equ 0001h
RE2PPS_RE2PPS5_MASK                      equ 0020h

// Register: CANRXPPS
#define CANRXPPS CANRXPPS
CANRXPPS                                 equ 023Dh
// bitfield definitions
CANRXPPS_PIN_POSN                        equ 0000h
CANRXPPS_PIN_POSITION                    equ 0000h
CANRXPPS_PIN_SIZE                        equ 0003h
CANRXPPS_PIN_LENGTH                      equ 0003h
CANRXPPS_PIN_MASK                        equ 0007h
CANRXPPS_PORT_POSN                       equ 0003h
CANRXPPS_PORT_POSITION                   equ 0003h
CANRXPPS_PORT_SIZE                       equ 0002h
CANRXPPS_PORT_LENGTH                     equ 0002h
CANRXPPS_PORT_MASK                       equ 0018h
CANRXPPS_CANRXPPS0_POSN                  equ 0000h
CANRXPPS_CANRXPPS0_POSITION              equ 0000h
CANRXPPS_CANRXPPS0_SIZE                  equ 0001h
CANRXPPS_CANRXPPS0_LENGTH                equ 0001h
CANRXPPS_CANRXPPS0_MASK                  equ 0001h
CANRXPPS_CANRXPPS1_POSN                  equ 0001h
CANRXPPS_CANRXPPS1_POSITION              equ 0001h
CANRXPPS_CANRXPPS1_SIZE                  equ 0001h
CANRXPPS_CANRXPPS1_LENGTH                equ 0001h
CANRXPPS_CANRXPPS1_MASK                  equ 0002h
CANRXPPS_CANRXPPS2_POSN                  equ 0002h
CANRXPPS_CANRXPPS2_POSITION              equ 0002h
CANRXPPS_CANRXPPS2_SIZE                  equ 0001h
CANRXPPS_CANRXPPS2_LENGTH                equ 0001h
CANRXPPS_CANRXPPS2_MASK                  equ 0004h
CANRXPPS_CANRXPPS3_POSN                  equ 0003h
CANRXPPS_CANRXPPS3_POSITION              equ 0003h
CANRXPPS_CANRXPPS3_SIZE                  equ 0001h
CANRXPPS_CANRXPPS3_LENGTH                equ 0001h
CANRXPPS_CANRXPPS3_MASK                  equ 0008h
CANRXPPS_CANRXPPS4_POSN                  equ 0004h
CANRXPPS_CANRXPPS4_POSITION              equ 0004h
CANRXPPS_CANRXPPS4_SIZE                  equ 0001h
CANRXPPS_CANRXPPS4_LENGTH                equ 0001h
CANRXPPS_CANRXPPS4_MASK                  equ 0010h
CANRXPPS_CANRXPPS_POSN                   equ 0000h
CANRXPPS_CANRXPPS_POSITION               equ 0000h
CANRXPPS_CANRXPPS_SIZE                   equ 0005h
CANRXPPS_CANRXPPS_LENGTH                 equ 0005h
CANRXPPS_CANRXPPS_MASK                   equ 001Fh

