GopalSaraf/Practicals/PSDL/include/proc/pic18f46q84.inc
// Register: U4CTSPPS
#define U4CTSPPS U4CTSPPS
U4CTSPPS                                 equ 0279h
// bitfield definitions
U4CTSPPS_PIN_POSN                        equ 0000h
U4CTSPPS_PIN_POSITION                    equ 0000h
U4CTSPPS_PIN_SIZE                        equ 0003h
U4CTSPPS_PIN_LENGTH                      equ 0003h
U4CTSPPS_PIN_MASK                        equ 0007h
U4CTSPPS_PORT_POSN                       equ 0003h
U4CTSPPS_PORT_POSITION                   equ 0003h
U4CTSPPS_PORT_SIZE                       equ 0002h
U4CTSPPS_PORT_LENGTH                     equ 0002h
U4CTSPPS_PORT_MASK                       equ 0018h
U4CTSPPS_U4CTSPPS_POSN                   equ 0000h
U4CTSPPS_U4CTSPPS_POSITION               equ 0000h
U4CTSPPS_U4CTSPPS_SIZE                   equ 0005h
U4CTSPPS_U4CTSPPS_LENGTH                 equ 0005h
U4CTSPPS_U4CTSPPS_MASK                   equ 001Fh
U4CTSPPS_U4CTSPPS0_POSN                  equ 0000h
U4CTSPPS_U4CTSPPS0_POSITION              equ 0000h
U4CTSPPS_U4CTSPPS0_SIZE                  equ 0001h
U4CTSPPS_U4CTSPPS0_LENGTH                equ 0001h
U4CTSPPS_U4CTSPPS0_MASK                  equ 0001h
U4CTSPPS_U4CTSPPS1_POSN                  equ 0001h
U4CTSPPS_U4CTSPPS1_POSITION              equ 0001h
U4CTSPPS_U4CTSPPS1_SIZE                  equ 0001h
U4CTSPPS_U4CTSPPS1_LENGTH                equ 0001h
U4CTSPPS_U4CTSPPS1_MASK                  equ 0002h
U4CTSPPS_U4CTSPPS2_POSN                  equ 0002h
U4CTSPPS_U4CTSPPS2_POSITION              equ 0002h
U4CTSPPS_U4CTSPPS2_SIZE                  equ 0001h
U4CTSPPS_U4CTSPPS2_LENGTH                equ 0001h
U4CTSPPS_U4CTSPPS2_MASK                  equ 0004h
U4CTSPPS_U4CTSPPS3_POSN                  equ 0003h
U4CTSPPS_U4CTSPPS3_POSITION              equ 0003h
U4CTSPPS_U4CTSPPS3_SIZE                  equ 0001h
U4CTSPPS_U4CTSPPS3_LENGTH                equ 0001h
U4CTSPPS_U4CTSPPS3_MASK                  equ 0008h
U4CTSPPS_U4CTSPPS4_POSN                  equ 0004h
U4CTSPPS_U4CTSPPS4_POSITION              equ 0004h
U4CTSPPS_U4CTSPPS4_SIZE                  equ 0001h
U4CTSPPS_U4CTSPPS4_LENGTH                equ 0001h
U4CTSPPS_U4CTSPPS4_MASK                  equ 0010h

// Register: U5RXPPS
#define U5RXPPS U5RXPPS
U5RXPPS                                  equ 027Ah
// bitfield definitions
U5RXPPS_PIN_POSN                         equ 0000h
U5RXPPS_PIN_POSITION                     equ 0000h
U5RXPPS_PIN_SIZE                         equ 0003h
U5RXPPS_PIN_LENGTH                       equ 0003h
U5RXPPS_PIN_MASK                         equ 0007h
U5RXPPS_PORT_POSN                        equ 0003h
U5RXPPS_PORT_POSITION                    equ 0003h
U5RXPPS_PORT_SIZE                        equ 0003h
U5RXPPS_PORT_LENGTH                      equ 0003h
U5RXPPS_PORT_MASK                        equ 0038h
U5RXPPS_U5RXPPS_POSN                     equ 0000h
U5RXPPS_U5RXPPS_POSITION                 equ 0000h
U5RXPPS_U5RXPPS_SIZE                     equ 0006h
U5RXPPS_U5RXPPS_LENGTH                   equ 0006h
U5RXPPS_U5RXPPS_MASK                     equ 003Fh
U5RXPPS_U5RXPPS0_POSN                    equ 0000h
U5RXPPS_U5RXPPS0_POSITION                equ 0000h
U5RXPPS_U5RXPPS0_SIZE                    equ 0001h
U5RXPPS_U5RXPPS0_LENGTH                  equ 0001h
U5RXPPS_U5RXPPS0_MASK                    equ 0001h
U5RXPPS_U5RXPPS1_POSN                    equ 0001h
U5RXPPS_U5RXPPS1_POSITION                equ 0001h
U5RXPPS_U5RXPPS1_SIZE                    equ 0001h
U5RXPPS_U5RXPPS1_LENGTH                  equ 0001h
U5RXPPS_U5RXPPS1_MASK                    equ 0002h
U5RXPPS_U5RXPPS2_POSN                    equ 0002h
U5RXPPS_U5RXPPS2_POSITION                equ 0002h
U5RXPPS_U5RXPPS2_SIZE                    equ 0001h
U5RXPPS_U5RXPPS2_LENGTH                  equ 0001h
U5RXPPS_U5RXPPS2_MASK                    equ 0004h
U5RXPPS_U5RXPPS3_POSN                    equ 0003h
U5RXPPS_U5RXPPS3_POSITION                equ 0003h
U5RXPPS_U5RXPPS3_SIZE                    equ 0001h
U5RXPPS_U5RXPPS3_LENGTH                  equ 0001h
U5RXPPS_U5RXPPS3_MASK                    equ 0008h
U5RXPPS_U5RXPPS4_POSN                    equ 0004h
U5RXPPS_U5RXPPS4_POSITION                equ 0004h
U5RXPPS_U5RXPPS4_SIZE                    equ 0001h
U5RXPPS_U5RXPPS4_LENGTH                  equ 0001h
U5RXPPS_U5RXPPS4_MASK                    equ 0010h
U5RXPPS_U5RXPPS5_POSN                    equ 0005h
U5RXPPS_U5RXPPS5_POSITION                equ 0005h
U5RXPPS_U5RXPPS5_SIZE                    equ 0001h
U5RXPPS_U5RXPPS5_LENGTH                  equ 0001h
U5RXPPS_U5RXPPS5_MASK                    equ 0020h

// Register: U5CTSPPS
#define U5CTSPPS U5CTSPPS
U5CTSPPS                                 equ 027Bh
// bitfield definitions
U5CTSPPS_PIN_POSN                        equ 0000h
U5CTSPPS_PIN_POSITION                    equ 0000h
U5CTSPPS_PIN_SIZE                        equ 0003h
U5CTSPPS_PIN_LENGTH                      equ 0003h
U5CTSPPS_PIN_MASK                        equ 0007h
U5CTSPPS_PORT_POSN                       equ 0003h
U5CTSPPS_PORT_POSITION                   equ 0003h
U5CTSPPS_PORT_SIZE                       equ 0003h
U5CTSPPS_PORT_LENGTH                     equ 0003h
U5CTSPPS_PORT_MASK                       equ 0038h
U5CTSPPS_U5CTSPPS_POSN                   equ 0000h
U5CTSPPS_U5CTSPPS_POSITION               equ 0000h
U5CTSPPS_U5CTSPPS_SIZE                   equ 0006h
U5CTSPPS_U5CTSPPS_LENGTH                 equ 0006h
U5CTSPPS_U5CTSPPS_MASK                   equ 003Fh
U5CTSPPS_U5CTSPPS0_POSN                  equ 0000h
U5CTSPPS_U5CTSPPS0_POSITION              equ 0000h
U5CTSPPS_U5CTSPPS0_SIZE                  equ 0001h
U5CTSPPS_U5CTSPPS0_LENGTH                equ 0001h
U5CTSPPS_U5CTSPPS0_MASK                  equ 0001h
U5CTSPPS_U5CTSPPS1_POSN                  equ 0001h
U5CTSPPS_U5CTSPPS1_POSITION              equ 0001h
U5CTSPPS_U5CTSPPS1_SIZE                  equ 0001h
U5CTSPPS_U5CTSPPS1_LENGTH                equ 0001h
U5CTSPPS_U5CTSPPS1_MASK                  equ 0002h
U5CTSPPS_U5CTSPPS2_POSN                  equ 0002h
U5CTSPPS_U5CTSPPS2_POSITION              equ 0002h
U5CTSPPS_U5CTSPPS2_SIZE                  equ 0001h
U5CTSPPS_U5CTSPPS2_LENGTH                equ 0001h
U5CTSPPS_U5CTSPPS2_MASK                  equ 0004h
U5CTSPPS_U5CTSPPS3_POSN                  equ 0003h
U5CTSPPS_U5CTSPPS3_POSITION              equ 0003h
U5CTSPPS_U5CTSPPS3_SIZE                  equ 0001h
U5CTSPPS_U5CTSPPS3_LENGTH                equ 0001h
U5CTSPPS_U5CTSPPS3_MASK                  equ 0008h
U5CTSPPS_U5CTSPPS4_POSN                  equ 0004h
U5CTSPPS_U5CTSPPS4_POSITION              equ 0004h
U5CTSPPS_U5CTSPPS4_SIZE                  equ 0001h
U5CTSPPS_U5CTSPPS4_LENGTH                equ 0001h
U5CTSPPS_U5CTSPPS4_MASK                  equ 0010h
U5CTSPPS_U5CTSPPS5_POSN                  equ 0005h
U5CTSPPS_U5CTSPPS5_POSITION              equ 0005h
U5CTSPPS_U5CTSPPS5_SIZE                  equ 0001h
U5CTSPPS_U5CTSPPS5_LENGTH                equ 0001h
U5CTSPPS_U5CTSPPS5_MASK                  equ 0020h

// Register: RC4I2C
#define RC4I2C RC4I2C
RC4I2C                                   equ 0286h
// bitfield definitions
RC4I2C_TH_POSN                           equ 0000h
RC4I2C_TH_POSITION                       equ 0000h
RC4I2C_TH_SIZE                           equ 0002h
RC4I2C_TH_LENGTH                         equ 0002h
RC4I2C_TH_MASK                           equ 0003h
RC4I2C_PU_POSN                           equ 0004h
RC4I2C_PU_POSITION                       equ 0004h
RC4I2C_PU_SIZE                           equ 0002h
RC4I2C_PU_LENGTH                         equ 0002h
RC4I2C_PU_MASK                           equ 0030h
RC4I2C_SLEW_POSN                         equ 0006h
RC4I2C_SLEW_POSITION                     equ 0006h
RC4I2C_SLEW_SIZE                         equ 0002h
RC4I2C_SLEW_LENGTH                       equ 0002h
RC4I2C_SLEW_MASK                         equ 00C0h
RC4I2C_TH0_POSN                          equ 0000h
RC4I2C_TH0_POSITION                      equ 0000h
RC4I2C_TH0_SIZE                          equ 0001h
RC4I2C_TH0_LENGTH                        equ 0001h
RC4I2C_TH0_MASK                          equ 0001h
RC4I2C_TH1_POSN                          equ 0001h
RC4I2C_TH1_POSITION                      equ 0001h
RC4I2C_TH1_SIZE                          equ 0001h
RC4I2C_TH1_LENGTH                        equ 0001h
RC4I2C_TH1_MASK                          equ 0002h
RC4I2C_PU0_POSN                          equ 0004h
RC4I2C_PU0_POSITION                      equ 0004h
RC4I2C_PU0_SIZE                          equ 0001h
RC4I2C_PU0_LENGTH                        equ 0001h
RC4I2C_PU0_MASK                          equ 0010h
RC4I2C_PU1_POSN                          equ 0005h
RC4I2C_PU1_POSITION                      equ 0005h
RC4I2C_PU1_SIZE                          equ 0001h
RC4I2C_PU1_LENGTH                        equ 0001h
RC4I2C_PU1_MASK                          equ 0020h
RC4I2C_SLEW0_POSN                        equ 0006h
RC4I2C_SLEW0_POSITION                    equ 0006h
RC4I2C_SLEW0_SIZE                        equ 0001h
RC4I2C_SLEW0_LENGTH                      equ 0001h
RC4I2C_SLEW0_MASK                        equ 0040h
RC4I2C_SLEW1_POSN                        equ 0007h
RC4I2C_SLEW1_POSITION                    equ 0007h
RC4I2C_SLEW1_SIZE                        equ 0001h
RC4I2C_SLEW1_LENGTH                      equ 0001h
RC4I2C_SLEW1_MASK                        equ 0080h
RC4I2C_I2CTH_POSN                        equ 0000h
RC4I2C_I2CTH_POSITION                    equ 0000h
RC4I2C_I2CTH_SIZE                        equ 0002h
RC4I2C_I2CTH_LENGTH                      equ 0002h
RC4I2C_I2CTH_MASK                        equ 0003h
RC4I2C_I2CPU_POSN                        equ 0004h
RC4I2C_I2CPU_POSITION                    equ 0004h
RC4I2C_I2CPU_SIZE                        equ 0002h
RC4I2C_I2CPU_LENGTH                      equ 0002h
RC4I2C_I2CPU_MASK                        equ 0030h
RC4I2C_I2CSLEW_POSN                      equ 0006h
RC4I2C_I2CSLEW_POSITION                  equ 0006h
RC4I2C_I2CSLEW_SIZE                      equ 0002h
RC4I2C_I2CSLEW_LENGTH                    equ 0002h
RC4I2C_I2CSLEW_MASK                      equ 00C0h
RC4I2C_I2CTH0_POSN                       equ 0000h
RC4I2C_I2CTH0_POSITION                   equ 0000h
RC4I2C_I2CTH0_SIZE                       equ 0001h
RC4I2C_I2CTH0_LENGTH                     equ 0001h
RC4I2C_I2CTH0_MASK                       equ 0001h
RC4I2C_I2CTH1_POSN                       equ 0001h
RC4I2C_I2CTH1_POSITION                   equ 0001h
RC4I2C_I2CTH1_SIZE                       equ 0001h
RC4I2C_I2CTH1_LENGTH                     equ 0001h
RC4I2C_I2CTH1_MASK                       equ 0002h
RC4I2C_I2CPU0_POSN                       equ 0004h
RC4I2C_I2CPU0_POSITION                   equ 0004h
RC4I2C_I2CPU0_SIZE                       equ 0001h
RC4I2C_I2CPU0_LENGTH                     equ 0001h
RC4I2C_I2CPU0_MASK                       equ 0010h
RC4I2C_I2CPU1_POSN                       equ 0005h
RC4I2C_I2CPU1_POSITION                   equ 0005h
RC4I2C_I2CPU1_SIZE                       equ 0001h
RC4I2C_I2CPU1_LENGTH                     equ 0001h
RC4I2C_I2CPU1_MASK                       equ 0020h
RC4I2C_I2CSLEW0_POSN                     equ 0006h
RC4I2C_I2CSLEW0_POSITION                 equ 0006h
RC4I2C_I2CSLEW0_SIZE                     equ 0001h
RC4I2C_I2CSLEW0_LENGTH                   equ 0001h
RC4I2C_I2CSLEW0_MASK                     equ 0040h
RC4I2C_I2CSLEW1_POSN                     equ 0007h
RC4I2C_I2CSLEW1_POSITION                 equ 0007h
RC4I2C_I2CSLEW1_SIZE                     equ 0001h
RC4I2C_I2CSLEW1_LENGTH                   equ 0001h
RC4I2C_I2CSLEW1_MASK                     equ 0080h

// Register: RC3I2C
#define RC3I2C RC3I2C
RC3I2C                                   equ 0287h
// bitfield definitions
RC3I2C_TH_POSN                           equ 0000h
RC3I2C_TH_POSITION                       equ 0000h
RC3I2C_TH_SIZE                           equ 0002h
RC3I2C_TH_LENGTH                         equ 0002h
RC3I2C_TH_MASK                           equ 0003h
RC3I2C_PU_POSN                           equ 0004h
RC3I2C_PU_POSITION                       equ 0004h
RC3I2C_PU_SIZE                           equ 0002h
RC3I2C_PU_LENGTH                         equ 0002h
RC3I2C_PU_MASK                           equ 0030h
RC3I2C_SLEW_POSN                         equ 0006h
RC3I2C_SLEW_POSITION                     equ 0006h
RC3I2C_SLEW_SIZE                         equ 0002h
RC3I2C_SLEW_LENGTH                       equ 0002h
RC3I2C_SLEW_MASK                         equ 00C0h
RC3I2C_TH0_POSN                          equ 0000h
RC3I2C_TH0_POSITION                      equ 0000h
RC3I2C_TH0_SIZE                          equ 0001h
RC3I2C_TH0_LENGTH                        equ 0001h
RC3I2C_TH0_MASK                          equ 0001h
RC3I2C_TH1_POSN                          equ 0001h
RC3I2C_TH1_POSITION                      equ 0001h
RC3I2C_TH1_SIZE                          equ 0001h
RC3I2C_TH1_LENGTH                        equ 0001h
RC3I2C_TH1_MASK                          equ 0002h
RC3I2C_PU0_POSN                          equ 0004h
RC3I2C_PU0_POSITION                      equ 0004h
RC3I2C_PU0_SIZE                          equ 0001h
RC3I2C_PU0_LENGTH                        equ 0001h
RC3I2C_PU0_MASK                          equ 0010h
RC3I2C_PU1_POSN                          equ 0005h
RC3I2C_PU1_POSITION                      equ 0005h
RC3I2C_PU1_SIZE                          equ 0001h
RC3I2C_PU1_LENGTH                        equ 0001h
RC3I2C_PU1_MASK                          equ 0020h
RC3I2C_SLEW0_POSN                        equ 0006h
RC3I2C_SLEW0_POSITION                    equ 0006h
RC3I2C_SLEW0_SIZE                        equ 0001h
RC3I2C_SLEW0_LENGTH                      equ 0001h
RC3I2C_SLEW0_MASK                        equ 0040h
RC3I2C_SLEW1_POSN                        equ 0007h
RC3I2C_SLEW1_POSITION                    equ 0007h
RC3I2C_SLEW1_SIZE                        equ 0001h
RC3I2C_SLEW1_LENGTH                      equ 0001h
RC3I2C_SLEW1_MASK                        equ 0080h
RC3I2C_I2CTH_POSN                        equ 0000h
RC3I2C_I2CTH_POSITION                    equ 0000h
RC3I2C_I2CTH_SIZE                        equ 0002h
RC3I2C_I2CTH_LENGTH                      equ 0002h
RC3I2C_I2CTH_MASK                        equ 0003h
RC3I2C_I2CPU_POSN                        equ 0004h
RC3I2C_I2CPU_POSITION                    equ 0004h
RC3I2C_I2CPU_SIZE                        equ 0002h
RC3I2C_I2CPU_LENGTH                      equ 0002h
RC3I2C_I2CPU_MASK                        equ 0030h
RC3I2C_I2CSLEW_POSN                      equ 0006h
RC3I2C_I2CSLEW_POSITION                  equ 0006h
RC3I2C_I2CSLEW_SIZE                      equ 0002h
RC3I2C_I2CSLEW_LENGTH                    equ 0002h
RC3I2C_I2CSLEW_MASK                      equ 00C0h
RC3I2C_I2CTH0_POSN                       equ 0000h
RC3I2C_I2CTH0_POSITION                   equ 0000h
RC3I2C_I2CTH0_SIZE                       equ 0001h
RC3I2C_I2CTH0_LENGTH                     equ 0001h
RC3I2C_I2CTH0_MASK                       equ 0001h
RC3I2C_I2CTH1_POSN                       equ 0001h
RC3I2C_I2CTH1_POSITION                   equ 0001h
RC3I2C_I2CTH1_SIZE                       equ 0001h
RC3I2C_I2CTH1_LENGTH                     equ 0001h
RC3I2C_I2CTH1_MASK                       equ 0002h
RC3I2C_I2CPU0_POSN                       equ 0004h
RC3I2C_I2CPU0_POSITION                   equ 0004h
RC3I2C_I2CPU0_SIZE                       equ 0001h
RC3I2C_I2CPU0_LENGTH                     equ 0001h
RC3I2C_I2CPU0_MASK                       equ 0010h
RC3I2C_I2CPU1_POSN                       equ 0005h
RC3I2C_I2CPU1_POSITION                   equ 0005h
RC3I2C_I2CPU1_SIZE                       equ 0001h
RC3I2C_I2CPU1_LENGTH                     equ 0001h
RC3I2C_I2CPU1_MASK                       equ 0020h
RC3I2C_I2CSLEW0_POSN                     equ 0006h
RC3I2C_I2CSLEW0_POSITION                 equ 0006h
RC3I2C_I2CSLEW0_SIZE                     equ 0001h
RC3I2C_I2CSLEW0_LENGTH                   equ 0001h
RC3I2C_I2CSLEW0_MASK                     equ 0040h
RC3I2C_I2CSLEW1_POSN                     equ 0007h
RC3I2C_I2CSLEW1_POSITION                 equ 0007h
RC3I2C_I2CSLEW1_SIZE                     equ 0001h
RC3I2C_I2CSLEW1_LENGTH                   equ 0001h
RC3I2C_I2CSLEW1_MASK                     equ 0080h

// Register: RB2I2C
#define RB2I2C RB2I2C
RB2I2C                                   equ 0288h
// bitfield definitions
RB2I2C_TH_POSN                           equ 0000h
RB2I2C_TH_POSITION                       equ 0000h
RB2I2C_TH_SIZE                           equ 0002h
RB2I2C_TH_LENGTH                         equ 0002h
RB2I2C_TH_MASK                           equ 0003h
RB2I2C_PU_POSN                           equ 0004h
RB2I2C_PU_POSITION                       equ 0004h
RB2I2C_PU_SIZE                           equ 0002h
RB2I2C_PU_LENGTH                         equ 0002h
RB2I2C_PU_MASK                           equ 0030h
RB2I2C_SLEW_POSN                         equ 0006h
RB2I2C_SLEW_POSITION                     equ 0006h
RB2I2C_SLEW_SIZE                         equ 0002h
RB2I2C_SLEW_LENGTH                       equ 0002h
RB2I2C_SLEW_MASK                         equ 00C0h
RB2I2C_TH0_POSN                          equ 0000h
RB2I2C_TH0_POSITION                      equ 0000h
RB2I2C_TH0_SIZE                          equ 0001h
RB2I2C_TH0_LENGTH                        equ 0001h
RB2I2C_TH0_MASK                          equ 0001h
RB2I2C_TH1_POSN                          equ 0001h
RB2I2C_TH1_POSITION                      equ 0001h
RB2I2C_TH1_SIZE                          equ 0001h
RB2I2C_TH1_LENGTH                        equ 0001h
RB2I2C_TH1_MASK                          equ 0002h
RB2I2C_PU0_POSN                          equ 0004h
RB2I2C_PU0_POSITION                      equ 0004h
RB2I2C_PU0_SIZE                          equ 0001h
RB2I2C_PU0_LENGTH                        equ 0001h
RB2I2C_PU0_MASK                          equ 0010h
RB2I2C_PU1_POSN                          equ 0005h
RB2I2C_PU1_POSITION                      equ 0005h
RB2I2C_PU1_SIZE                          equ 0001h
RB2I2C_PU1_LENGTH                        equ 0001h
RB2I2C_PU1_MASK                          equ 0020h
RB2I2C_SLEW0_POSN                        equ 0006h
RB2I2C_SLEW0_POSITION                    equ 0006h
RB2I2C_SLEW0_SIZE                        equ 0001h
RB2I2C_SLEW0_LENGTH                      equ 0001h
RB2I2C_SLEW0_MASK                        equ 0040h
RB2I2C_SLEW1_POSN                        equ 0007h
RB2I2C_SLEW1_POSITION                    equ 0007h
RB2I2C_SLEW1_SIZE                        equ 0001h
RB2I2C_SLEW1_LENGTH                      equ 0001h
RB2I2C_SLEW1_MASK                        equ 0080h
RB2I2C_I2CTH_POSN                        equ 0000h
RB2I2C_I2CTH_POSITION                    equ 0000h
RB2I2C_I2CTH_SIZE                        equ 0002h
RB2I2C_I2CTH_LENGTH                      equ 0002h
RB2I2C_I2CTH_MASK                        equ 0003h
RB2I2C_I2CPU_POSN                        equ 0004h
RB2I2C_I2CPU_POSITION                    equ 0004h
RB2I2C_I2CPU_SIZE                        equ 0002h
RB2I2C_I2CPU_LENGTH                      equ 0002h
RB2I2C_I2CPU_MASK                        equ 0030h
RB2I2C_I2CSLEW_POSN                      equ 0006h
RB2I2C_I2CSLEW_POSITION                  equ 0006h
RB2I2C_I2CSLEW_SIZE                      equ 0002h
RB2I2C_I2CSLEW_LENGTH                    equ 0002h
RB2I2C_I2CSLEW_MASK                      equ 00C0h
RB2I2C_I2CTH0_POSN                       equ 0000h
RB2I2C_I2CTH0_POSITION                   equ 0000h
RB2I2C_I2CTH0_SIZE                       equ 0001h
RB2I2C_I2CTH0_LENGTH                     equ 0001h
RB2I2C_I2CTH0_MASK                       equ 0001h
RB2I2C_I2CTH1_POSN                       equ 0001h
RB2I2C_I2CTH1_POSITION                   equ 0001h
RB2I2C_I2CTH1_SIZE                       equ 0001h
RB2I2C_I2CTH1_LENGTH                     equ 0001h
RB2I2C_I2CTH1_MASK                       equ 0002h
RB2I2C_I2CPU0_POSN                       equ 0004h
RB2I2C_I2CPU0_POSITION                   equ 0004h
RB2I2C_I2CPU0_SIZE                       equ 0001h
RB2I2C_I2CPU0_LENGTH                     equ 0001h
RB2I2C_I2CPU0_MASK                       equ 0010h
RB2I2C_I2CPU1_POSN                       equ 0005h
RB2I2C_I2CPU1_POSITION                   equ 0005h
RB2I2C_I2CPU1_SIZE                       equ 0001h
RB2I2C_I2CPU1_LENGTH                     equ 0001h
RB2I2C_I2CPU1_MASK                       equ 0020h
RB2I2C_I2CSLEW0_POSN                     equ 0006h
RB2I2C_I2CSLEW0_POSITION                 equ 0006h
RB2I2C_I2CSLEW0_SIZE                     equ 0001h
RB2I2C_I2CSLEW0_LENGTH                   equ 0001h
RB2I2C_I2CSLEW0_MASK                     equ 0040h
RB2I2C_I2CSLEW1_POSN                     equ 0007h
RB2I2C_I2CSLEW1_POSITION                 equ 0007h
RB2I2C_I2CSLEW1_SIZE                     equ 0001h
RB2I2C_I2CSLEW1_LENGTH                   equ 0001h
RB2I2C_I2CSLEW1_MASK                     equ 0080h

