GopalSaraf/Practicals/PSDL/include/proc/pic18f46q84.inc
// Register: T4HLT
#define T4HLT T4HLT
T4HLT                                    equ 0331h
// bitfield definitions
T4HLT_MODE_POSN                          equ 0000h
T4HLT_MODE_POSITION                      equ 0000h
T4HLT_MODE_SIZE                          equ 0005h
T4HLT_MODE_LENGTH                        equ 0005h
T4HLT_MODE_MASK                          equ 001Fh
T4HLT_CKSYNC_POSN                        equ 0005h
T4HLT_CKSYNC_POSITION                    equ 0005h
T4HLT_CKSYNC_SIZE                        equ 0001h
T4HLT_CKSYNC_LENGTH                      equ 0001h
T4HLT_CKSYNC_MASK                        equ 0020h
T4HLT_CKPOL_POSN                         equ 0006h
T4HLT_CKPOL_POSITION                     equ 0006h
T4HLT_CKPOL_SIZE                         equ 0001h
T4HLT_CKPOL_LENGTH                       equ 0001h
T4HLT_CKPOL_MASK                         equ 0040h
T4HLT_PSYNC_POSN                         equ 0007h
T4HLT_PSYNC_POSITION                     equ 0007h
T4HLT_PSYNC_SIZE                         equ 0001h
T4HLT_PSYNC_LENGTH                       equ 0001h
T4HLT_PSYNC_MASK                         equ 0080h
T4HLT_MODE0_POSN                         equ 0000h
T4HLT_MODE0_POSITION                     equ 0000h
T4HLT_MODE0_SIZE                         equ 0001h
T4HLT_MODE0_LENGTH                       equ 0001h
T4HLT_MODE0_MASK                         equ 0001h
T4HLT_MODE1_POSN                         equ 0001h
T4HLT_MODE1_POSITION                     equ 0001h
T4HLT_MODE1_SIZE                         equ 0001h
T4HLT_MODE1_LENGTH                       equ 0001h
T4HLT_MODE1_MASK                         equ 0002h
T4HLT_MODE2_POSN                         equ 0002h
T4HLT_MODE2_POSITION                     equ 0002h
T4HLT_MODE2_SIZE                         equ 0001h
T4HLT_MODE2_LENGTH                       equ 0001h
T4HLT_MODE2_MASK                         equ 0004h
T4HLT_MODE3_POSN                         equ 0003h
T4HLT_MODE3_POSITION                     equ 0003h
T4HLT_MODE3_SIZE                         equ 0001h
T4HLT_MODE3_LENGTH                       equ 0001h
T4HLT_MODE3_MASK                         equ 0008h
T4HLT_MODE4_POSN                         equ 0004h
T4HLT_MODE4_POSITION                     equ 0004h
T4HLT_MODE4_SIZE                         equ 0001h
T4HLT_MODE4_LENGTH                       equ 0001h
T4HLT_MODE4_MASK                         equ 0010h
T4HLT_T4MODE_POSN                        equ 0000h
T4HLT_T4MODE_POSITION                    equ 0000h
T4HLT_T4MODE_SIZE                        equ 0005h
T4HLT_T4MODE_LENGTH                      equ 0005h
T4HLT_T4MODE_MASK                        equ 001Fh
T4HLT_T4CKSYNC_POSN                      equ 0005h
T4HLT_T4CKSYNC_POSITION                  equ 0005h
T4HLT_T4CKSYNC_SIZE                      equ 0001h
T4HLT_T4CKSYNC_LENGTH                    equ 0001h
T4HLT_T4CKSYNC_MASK                      equ 0020h
T4HLT_T4CKPOL_POSN                       equ 0006h
T4HLT_T4CKPOL_POSITION                   equ 0006h
T4HLT_T4CKPOL_SIZE                       equ 0001h
T4HLT_T4CKPOL_LENGTH                     equ 0001h
T4HLT_T4CKPOL_MASK                       equ 0040h
T4HLT_T4PSYNC_POSN                       equ 0007h
T4HLT_T4PSYNC_POSITION                   equ 0007h
T4HLT_T4PSYNC_SIZE                       equ 0001h
T4HLT_T4PSYNC_LENGTH                     equ 0001h
T4HLT_T4PSYNC_MASK                       equ 0080h
T4HLT_T4MODE0_POSN                       equ 0000h
T4HLT_T4MODE0_POSITION                   equ 0000h
T4HLT_T4MODE0_SIZE                       equ 0001h
T4HLT_T4MODE0_LENGTH                     equ 0001h
T4HLT_T4MODE0_MASK                       equ 0001h
T4HLT_T4MODE1_POSN                       equ 0001h
T4HLT_T4MODE1_POSITION                   equ 0001h
T4HLT_T4MODE1_SIZE                       equ 0001h
T4HLT_T4MODE1_LENGTH                     equ 0001h
T4HLT_T4MODE1_MASK                       equ 0002h
T4HLT_T4MODE2_POSN                       equ 0002h
T4HLT_T4MODE2_POSITION                   equ 0002h
T4HLT_T4MODE2_SIZE                       equ 0001h
T4HLT_T4MODE2_LENGTH                     equ 0001h
T4HLT_T4MODE2_MASK                       equ 0004h
T4HLT_T4MODE3_POSN                       equ 0003h
T4HLT_T4MODE3_POSITION                   equ 0003h
T4HLT_T4MODE3_SIZE                       equ 0001h
T4HLT_T4MODE3_LENGTH                     equ 0001h
T4HLT_T4MODE3_MASK                       equ 0008h
T4HLT_T4MODE4_POSN                       equ 0004h
T4HLT_T4MODE4_POSITION                   equ 0004h
T4HLT_T4MODE4_SIZE                       equ 0001h
T4HLT_T4MODE4_LENGTH                     equ 0001h
T4HLT_T4MODE4_MASK                       equ 0010h

// Register: T4CLKCON
#define T4CLKCON T4CLKCON
T4CLKCON                                 equ 0332h
// bitfield definitions
T4CLKCON_CS_POSN                         equ 0000h
T4CLKCON_CS_POSITION                     equ 0000h
T4CLKCON_CS_SIZE                         equ 0004h
T4CLKCON_CS_LENGTH                       equ 0004h
T4CLKCON_CS_MASK                         equ 000Fh
T4CLKCON_CS0_POSN                        equ 0000h
T4CLKCON_CS0_POSITION                    equ 0000h
T4CLKCON_CS0_SIZE                        equ 0001h
T4CLKCON_CS0_LENGTH                      equ 0001h
T4CLKCON_CS0_MASK                        equ 0001h
T4CLKCON_CS1_POSN                        equ 0001h
T4CLKCON_CS1_POSITION                    equ 0001h
T4CLKCON_CS1_SIZE                        equ 0001h
T4CLKCON_CS1_LENGTH                      equ 0001h
T4CLKCON_CS1_MASK                        equ 0002h
T4CLKCON_CS2_POSN                        equ 0002h
T4CLKCON_CS2_POSITION                    equ 0002h
T4CLKCON_CS2_SIZE                        equ 0001h
T4CLKCON_CS2_LENGTH                      equ 0001h
T4CLKCON_CS2_MASK                        equ 0004h
T4CLKCON_CS3_POSN                        equ 0003h
T4CLKCON_CS3_POSITION                    equ 0003h
T4CLKCON_CS3_SIZE                        equ 0001h
T4CLKCON_CS3_LENGTH                      equ 0001h
T4CLKCON_CS3_MASK                        equ 0008h
T4CLKCON_T4CS_POSN                       equ 0000h
T4CLKCON_T4CS_POSITION                   equ 0000h
T4CLKCON_T4CS_SIZE                       equ 0004h
T4CLKCON_T4CS_LENGTH                     equ 0004h
T4CLKCON_T4CS_MASK                       equ 000Fh
T4CLKCON_T4CS0_POSN                      equ 0000h
T4CLKCON_T4CS0_POSITION                  equ 0000h
T4CLKCON_T4CS0_SIZE                      equ 0001h
T4CLKCON_T4CS0_LENGTH                    equ 0001h
T4CLKCON_T4CS0_MASK                      equ 0001h
T4CLKCON_T4CS1_POSN                      equ 0001h
T4CLKCON_T4CS1_POSITION                  equ 0001h
T4CLKCON_T4CS1_SIZE                      equ 0001h
T4CLKCON_T4CS1_LENGTH                    equ 0001h
T4CLKCON_T4CS1_MASK                      equ 0002h
T4CLKCON_T4CS2_POSN                      equ 0002h
T4CLKCON_T4CS2_POSITION                  equ 0002h
T4CLKCON_T4CS2_SIZE                      equ 0001h
T4CLKCON_T4CS2_LENGTH                    equ 0001h
T4CLKCON_T4CS2_MASK                      equ 0004h
T4CLKCON_T4CS3_POSN                      equ 0003h
T4CLKCON_T4CS3_POSITION                  equ 0003h
T4CLKCON_T4CS3_SIZE                      equ 0001h
T4CLKCON_T4CS3_LENGTH                    equ 0001h
T4CLKCON_T4CS3_MASK                      equ 0008h

// Register: T4RST
#define T4RST T4RST
T4RST                                    equ 0333h
// bitfield definitions
T4RST_RSEL_POSN                          equ 0000h
T4RST_RSEL_POSITION                      equ 0000h
T4RST_RSEL_SIZE                          equ 0005h
T4RST_RSEL_LENGTH                        equ 0005h
T4RST_RSEL_MASK                          equ 001Fh
T4RST_RSEL0_POSN                         equ 0000h
T4RST_RSEL0_POSITION                     equ 0000h
T4RST_RSEL0_SIZE                         equ 0001h
T4RST_RSEL0_LENGTH                       equ 0001h
T4RST_RSEL0_MASK                         equ 0001h
T4RST_RSEL1_POSN                         equ 0001h
T4RST_RSEL1_POSITION                     equ 0001h
T4RST_RSEL1_SIZE                         equ 0001h
T4RST_RSEL1_LENGTH                       equ 0001h
T4RST_RSEL1_MASK                         equ 0002h
T4RST_RSEL2_POSN                         equ 0002h
T4RST_RSEL2_POSITION                     equ 0002h
T4RST_RSEL2_SIZE                         equ 0001h
T4RST_RSEL2_LENGTH                       equ 0001h
T4RST_RSEL2_MASK                         equ 0004h
T4RST_RSEL3_POSN                         equ 0003h
T4RST_RSEL3_POSITION                     equ 0003h
T4RST_RSEL3_SIZE                         equ 0001h
T4RST_RSEL3_LENGTH                       equ 0001h
T4RST_RSEL3_MASK                         equ 0008h
T4RST_RSEL4_POSN                         equ 0004h
T4RST_RSEL4_POSITION                     equ 0004h
T4RST_RSEL4_SIZE                         equ 0001h
T4RST_RSEL4_LENGTH                       equ 0001h
T4RST_RSEL4_MASK                         equ 0010h
T4RST_T4RSEL_POSN                        equ 0000h
T4RST_T4RSEL_POSITION                    equ 0000h
T4RST_T4RSEL_SIZE                        equ 0005h
T4RST_T4RSEL_LENGTH                      equ 0005h
T4RST_T4RSEL_MASK                        equ 001Fh
T4RST_T4RSEL0_POSN                       equ 0000h
T4RST_T4RSEL0_POSITION                   equ 0000h
T4RST_T4RSEL0_SIZE                       equ 0001h
T4RST_T4RSEL0_LENGTH                     equ 0001h
T4RST_T4RSEL0_MASK                       equ 0001h
T4RST_T4RSEL1_POSN                       equ 0001h
T4RST_T4RSEL1_POSITION                   equ 0001h
T4RST_T4RSEL1_SIZE                       equ 0001h
T4RST_T4RSEL1_LENGTH                     equ 0001h
T4RST_T4RSEL1_MASK                       equ 0002h
T4RST_T4RSEL2_POSN                       equ 0002h
T4RST_T4RSEL2_POSITION                   equ 0002h
T4RST_T4RSEL2_SIZE                       equ 0001h
T4RST_T4RSEL2_LENGTH                     equ 0001h
T4RST_T4RSEL2_MASK                       equ 0004h
T4RST_T4RSEL3_POSN                       equ 0003h
T4RST_T4RSEL3_POSITION                   equ 0003h
T4RST_T4RSEL3_SIZE                       equ 0001h
T4RST_T4RSEL3_LENGTH                     equ 0001h
T4RST_T4RSEL3_MASK                       equ 0008h
T4RST_T4RSEL4_POSN                       equ 0004h
T4RST_T4RSEL4_POSITION                   equ 0004h
T4RST_T4RSEL4_SIZE                       equ 0001h
T4RST_T4RSEL4_LENGTH                     equ 0001h
T4RST_T4RSEL4_MASK                       equ 0010h

// Register: TMR5L
#define TMR5L TMR5L
TMR5L                                    equ 0334h
// bitfield definitions
TMR5L_TMR5L_POSN                         equ 0000h
TMR5L_TMR5L_POSITION                     equ 0000h
TMR5L_TMR5L_SIZE                         equ 0008h
TMR5L_TMR5L_LENGTH                       equ 0008h
TMR5L_TMR5L_MASK                         equ 00FFh
TMR5L_TMR5L0_POSN                        equ 0000h
TMR5L_TMR5L0_POSITION                    equ 0000h
TMR5L_TMR5L0_SIZE                        equ 0001h
TMR5L_TMR5L0_LENGTH                      equ 0001h
TMR5L_TMR5L0_MASK                        equ 0001h
TMR5L_TMR5L1_POSN                        equ 0001h
TMR5L_TMR5L1_POSITION                    equ 0001h
TMR5L_TMR5L1_SIZE                        equ 0001h
TMR5L_TMR5L1_LENGTH                      equ 0001h
TMR5L_TMR5L1_MASK                        equ 0002h
TMR5L_TMR5L2_POSN                        equ 0002h
TMR5L_TMR5L2_POSITION                    equ 0002h
TMR5L_TMR5L2_SIZE                        equ 0001h
TMR5L_TMR5L2_LENGTH                      equ 0001h
TMR5L_TMR5L2_MASK                        equ 0004h
TMR5L_TMR5L3_POSN                        equ 0003h
TMR5L_TMR5L3_POSITION                    equ 0003h
TMR5L_TMR5L3_SIZE                        equ 0001h
TMR5L_TMR5L3_LENGTH                      equ 0001h
TMR5L_TMR5L3_MASK                        equ 0008h
TMR5L_TMR5L4_POSN                        equ 0004h
TMR5L_TMR5L4_POSITION                    equ 0004h
TMR5L_TMR5L4_SIZE                        equ 0001h
TMR5L_TMR5L4_LENGTH                      equ 0001h
TMR5L_TMR5L4_MASK                        equ 0010h
TMR5L_TMR5L5_POSN                        equ 0005h
TMR5L_TMR5L5_POSITION                    equ 0005h
TMR5L_TMR5L5_SIZE                        equ 0001h
TMR5L_TMR5L5_LENGTH                      equ 0001h
TMR5L_TMR5L5_MASK                        equ 0020h
TMR5L_TMR5L6_POSN                        equ 0006h
TMR5L_TMR5L6_POSITION                    equ 0006h
TMR5L_TMR5L6_SIZE                        equ 0001h
TMR5L_TMR5L6_LENGTH                      equ 0001h
TMR5L_TMR5L6_MASK                        equ 0040h
TMR5L_TMR5L7_POSN                        equ 0007h
TMR5L_TMR5L7_POSITION                    equ 0007h
TMR5L_TMR5L7_SIZE                        equ 0001h
TMR5L_TMR5L7_LENGTH                      equ 0001h
TMR5L_TMR5L7_MASK                        equ 0080h

// Register: TMR5H
#define TMR5H TMR5H
TMR5H                                    equ 0335h
// bitfield definitions
TMR5H_TMR5H_POSN                         equ 0000h
TMR5H_TMR5H_POSITION                     equ 0000h
TMR5H_TMR5H_SIZE                         equ 0008h
TMR5H_TMR5H_LENGTH                       equ 0008h
TMR5H_TMR5H_MASK                         equ 00FFh
TMR5H_TMR5H0_POSN                        equ 0000h
TMR5H_TMR5H0_POSITION                    equ 0000h
TMR5H_TMR5H0_SIZE                        equ 0001h
TMR5H_TMR5H0_LENGTH                      equ 0001h
TMR5H_TMR5H0_MASK                        equ 0001h
TMR5H_TMR5H1_POSN                        equ 0001h
TMR5H_TMR5H1_POSITION                    equ 0001h
TMR5H_TMR5H1_SIZE                        equ 0001h
TMR5H_TMR5H1_LENGTH                      equ 0001h
TMR5H_TMR5H1_MASK                        equ 0002h
TMR5H_TMR5H2_POSN                        equ 0002h
TMR5H_TMR5H2_POSITION                    equ 0002h
TMR5H_TMR5H2_SIZE                        equ 0001h
TMR5H_TMR5H2_LENGTH                      equ 0001h
TMR5H_TMR5H2_MASK                        equ 0004h
TMR5H_TMR5H3_POSN                        equ 0003h
TMR5H_TMR5H3_POSITION                    equ 0003h
TMR5H_TMR5H3_SIZE                        equ 0001h
TMR5H_TMR5H3_LENGTH                      equ 0001h
TMR5H_TMR5H3_MASK                        equ 0008h
TMR5H_TMR5H4_POSN                        equ 0004h
TMR5H_TMR5H4_POSITION                    equ 0004h
TMR5H_TMR5H4_SIZE                        equ 0001h
TMR5H_TMR5H4_LENGTH                      equ 0001h
TMR5H_TMR5H4_MASK                        equ 0010h
TMR5H_TMR5H5_POSN                        equ 0005h
TMR5H_TMR5H5_POSITION                    equ 0005h
TMR5H_TMR5H5_SIZE                        equ 0001h
TMR5H_TMR5H5_LENGTH                      equ 0001h
TMR5H_TMR5H5_MASK                        equ 0020h
TMR5H_TMR5H6_POSN                        equ 0006h
TMR5H_TMR5H6_POSITION                    equ 0006h
TMR5H_TMR5H6_SIZE                        equ 0001h
TMR5H_TMR5H6_LENGTH                      equ 0001h
TMR5H_TMR5H6_MASK                        equ 0040h
TMR5H_TMR5H7_POSN                        equ 0007h
TMR5H_TMR5H7_POSITION                    equ 0007h
TMR5H_TMR5H7_SIZE                        equ 0001h
TMR5H_TMR5H7_LENGTH                      equ 0001h
TMR5H_TMR5H7_MASK                        equ 0080h

// Register: T5CON
#define T5CON T5CON
T5CON                                    equ 0336h
// bitfield definitions
T5CON_ON_POSN                            equ 0000h
T5CON_ON_POSITION                        equ 0000h
T5CON_ON_SIZE                            equ 0001h
T5CON_ON_LENGTH                          equ 0001h
T5CON_ON_MASK                            equ 0001h
T5CON_RD16_POSN                          equ 0001h
T5CON_RD16_POSITION                      equ 0001h
T5CON_RD16_SIZE                          equ 0001h
T5CON_RD16_LENGTH                        equ 0001h
T5CON_RD16_MASK                          equ 0002h
T5CON_NOT_SYNC_POSN                      equ 0002h
T5CON_NOT_SYNC_POSITION                  equ 0002h
T5CON_NOT_SYNC_SIZE                      equ 0001h
T5CON_NOT_SYNC_LENGTH                    equ 0001h
T5CON_NOT_SYNC_MASK                      equ 0004h
T5CON_CKPS_POSN                          equ 0004h
T5CON_CKPS_POSITION                      equ 0004h
T5CON_CKPS_SIZE                          equ 0002h
T5CON_CKPS_LENGTH                        equ 0002h
T5CON_CKPS_MASK                          equ 0030h
T5CON_TMR5ON_POSN                        equ 0000h
T5CON_TMR5ON_POSITION                    equ 0000h
T5CON_TMR5ON_SIZE                        equ 0001h
T5CON_TMR5ON_LENGTH                      equ 0001h
T5CON_TMR5ON_MASK                        equ 0001h
T5CON_T5RD16_POSN                        equ 0001h
T5CON_T5RD16_POSITION                    equ 0001h
T5CON_T5RD16_SIZE                        equ 0001h
T5CON_T5RD16_LENGTH                      equ 0001h
T5CON_T5RD16_MASK                        equ 0002h
T5CON_NOT_T5SYNC_POSN                    equ 0002h
T5CON_NOT_T5SYNC_POSITION                equ 0002h
T5CON_NOT_T5SYNC_SIZE                    equ 0001h
T5CON_NOT_T5SYNC_LENGTH                  equ 0001h
T5CON_NOT_T5SYNC_MASK                    equ 0004h
T5CON_T5CKPS0_POSN                       equ 0004h
T5CON_T5CKPS0_POSITION                   equ 0004h
T5CON_T5CKPS0_SIZE                       equ 0001h
T5CON_T5CKPS0_LENGTH                     equ 0001h
T5CON_T5CKPS0_MASK                       equ 0010h
T5CON_T5CKPS1_POSN                       equ 0005h
T5CON_T5CKPS1_POSITION                   equ 0005h
T5CON_T5CKPS1_SIZE                       equ 0001h
T5CON_T5CKPS1_LENGTH                     equ 0001h
T5CON_T5CKPS1_MASK                       equ 0020h
T5CON_CKPS0_POSN                         equ 0004h
T5CON_CKPS0_POSITION                     equ 0004h
T5CON_CKPS0_SIZE                         equ 0001h
T5CON_CKPS0_LENGTH                       equ 0001h
T5CON_CKPS0_MASK                         equ 0010h
T5CON_CKPS1_POSN                         equ 0005h
T5CON_CKPS1_POSITION                     equ 0005h
T5CON_CKPS1_SIZE                         equ 0001h
T5CON_CKPS1_LENGTH                       equ 0001h
T5CON_CKPS1_MASK                         equ 0020h
T5CON_RD165_POSN                         equ 0001h
T5CON_RD165_POSITION                     equ 0001h
T5CON_RD165_SIZE                         equ 0001h
T5CON_RD165_LENGTH                       equ 0001h
T5CON_RD165_MASK                         equ 0002h

// Register: T5GCON
#define T5GCON T5GCON
T5GCON                                   equ 0337h
// bitfield definitions
T5GCON_GVAL_POSN                         equ 0002h
T5GCON_GVAL_POSITION                     equ 0002h
T5GCON_GVAL_SIZE                         equ 0001h
T5GCON_GVAL_LENGTH                       equ 0001h
T5GCON_GVAL_MASK                         equ 0004h
T5GCON_GGO_POSN                          equ 0003h
T5GCON_GGO_POSITION                      equ 0003h
T5GCON_GGO_SIZE                          equ 0001h
T5GCON_GGO_LENGTH                        equ 0001h
T5GCON_GGO_MASK                          equ 0008h
T5GCON_GSPM_POSN                         equ 0004h
T5GCON_GSPM_POSITION                     equ 0004h
T5GCON_GSPM_SIZE                         equ 0001h
T5GCON_GSPM_LENGTH                       equ 0001h
T5GCON_GSPM_MASK                         equ 0010h
T5GCON_GTM_POSN                          equ 0005h
T5GCON_GTM_POSITION                      equ 0005h
T5GCON_GTM_SIZE                          equ 0001h
T5GCON_GTM_LENGTH                        equ 0001h
T5GCON_GTM_MASK                          equ 0020h
T5GCON_GPOL_POSN                         equ 0006h
T5GCON_GPOL_POSITION                     equ 0006h
T5GCON_GPOL_SIZE                         equ 0001h
T5GCON_GPOL_LENGTH                       equ 0001h
T5GCON_GPOL_MASK                         equ 0040h
T5GCON_GE_POSN                           equ 0007h
T5GCON_GE_POSITION                       equ 0007h
T5GCON_GE_SIZE                           equ 0001h
T5GCON_GE_LENGTH                         equ 0001h
T5GCON_GE_MASK                           equ 0080h
T5GCON_T5GVAL_POSN                       equ 0002h
T5GCON_T5GVAL_POSITION                   equ 0002h
T5GCON_T5GVAL_SIZE                       equ 0001h
T5GCON_T5GVAL_LENGTH                     equ 0001h
T5GCON_T5GVAL_MASK                       equ 0004h
T5GCON_T5GGO_POSN                        equ 0003h
T5GCON_T5GGO_POSITION                    equ 0003h
T5GCON_T5GGO_SIZE                        equ 0001h
T5GCON_T5GGO_LENGTH                      equ 0001h
T5GCON_T5GGO_MASK                        equ 0008h
T5GCON_T5GSPM_POSN                       equ 0004h
T5GCON_T5GSPM_POSITION                   equ 0004h
T5GCON_T5GSPM_SIZE                       equ 0001h
T5GCON_T5GSPM_LENGTH                     equ 0001h
T5GCON_T5GSPM_MASK                       equ 0010h
T5GCON_T5GTM_POSN                        equ 0005h
T5GCON_T5GTM_POSITION                    equ 0005h
T5GCON_T5GTM_SIZE                        equ 0001h
T5GCON_T5GTM_LENGTH                      equ 0001h
T5GCON_T5GTM_MASK                        equ 0020h
T5GCON_T5GPOL_POSN                       equ 0006h
T5GCON_T5GPOL_POSITION                   equ 0006h
T5GCON_T5GPOL_SIZE                       equ 0001h
T5GCON_T5GPOL_LENGTH                     equ 0001h
T5GCON_T5GPOL_MASK                       equ 0040h
T5GCON_T5GE_POSN                         equ 0007h
T5GCON_T5GE_POSITION                     equ 0007h
T5GCON_T5GE_SIZE                         equ 0001h
T5GCON_T5GE_LENGTH                       equ 0001h
T5GCON_T5GE_MASK                         equ 0080h
T5GCON_NOT_DONE_POSN                     equ 0003h
T5GCON_NOT_DONE_POSITION                 equ 0003h
T5GCON_NOT_DONE_SIZE                     equ 0001h
T5GCON_NOT_DONE_LENGTH                   equ 0001h
T5GCON_NOT_DONE_MASK                     equ 0008h
T5GCON_NOT_T5DONE_POSN                   equ 0003h
T5GCON_NOT_T5DONE_POSITION               equ 0003h
T5GCON_NOT_T5DONE_SIZE                   equ 0001h
T5GCON_NOT_T5DONE_LENGTH                 equ 0001h
T5GCON_NOT_T5DONE_MASK                   equ 0008h

