GopalSaraf/Practicals/PSDL/include/proc/pic18f46q84.inc
// Register: NCO1ACCL
#define NCO1ACCL NCO1ACCL
NCO1ACCL                                 equ 0440h
// bitfield definitions
NCO1ACCL_ACC_POSN                        equ 0000h
NCO1ACCL_ACC_POSITION                    equ 0000h
NCO1ACCL_ACC_SIZE                        equ 0008h
NCO1ACCL_ACC_LENGTH                      equ 0008h
NCO1ACCL_ACC_MASK                        equ 00FFh
NCO1ACCL_NCO1ACC0_POSN                   equ 0000h
NCO1ACCL_NCO1ACC0_POSITION               equ 0000h
NCO1ACCL_NCO1ACC0_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC0_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC0_MASK                   equ 0001h
NCO1ACCL_NCO1ACC1_POSN                   equ 0001h
NCO1ACCL_NCO1ACC1_POSITION               equ 0001h
NCO1ACCL_NCO1ACC1_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC1_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC1_MASK                   equ 0002h
NCO1ACCL_NCO1ACC2_POSN                   equ 0002h
NCO1ACCL_NCO1ACC2_POSITION               equ 0002h
NCO1ACCL_NCO1ACC2_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC2_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC2_MASK                   equ 0004h
NCO1ACCL_NCO1ACC3_POSN                   equ 0003h
NCO1ACCL_NCO1ACC3_POSITION               equ 0003h
NCO1ACCL_NCO1ACC3_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC3_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC3_MASK                   equ 0008h
NCO1ACCL_NCO1ACC4_POSN                   equ 0004h
NCO1ACCL_NCO1ACC4_POSITION               equ 0004h
NCO1ACCL_NCO1ACC4_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC4_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC4_MASK                   equ 0010h
NCO1ACCL_NCO1ACC5_POSN                   equ 0005h
NCO1ACCL_NCO1ACC5_POSITION               equ 0005h
NCO1ACCL_NCO1ACC5_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC5_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC5_MASK                   equ 0020h
NCO1ACCL_NCO1ACC6_POSN                   equ 0006h
NCO1ACCL_NCO1ACC6_POSITION               equ 0006h
NCO1ACCL_NCO1ACC6_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC6_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC6_MASK                   equ 0040h
NCO1ACCL_NCO1ACC7_POSN                   equ 0007h
NCO1ACCL_NCO1ACC7_POSITION               equ 0007h
NCO1ACCL_NCO1ACC7_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC7_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC7_MASK                   equ 0080h
NCO1ACCL_ACC0_POSN                       equ 0000h
NCO1ACCL_ACC0_POSITION                   equ 0000h
NCO1ACCL_ACC0_SIZE                       equ 0001h
NCO1ACCL_ACC0_LENGTH                     equ 0001h
NCO1ACCL_ACC0_MASK                       equ 0001h
NCO1ACCL_ACC1_POSN                       equ 0001h
NCO1ACCL_ACC1_POSITION                   equ 0001h
NCO1ACCL_ACC1_SIZE                       equ 0001h
NCO1ACCL_ACC1_LENGTH                     equ 0001h
NCO1ACCL_ACC1_MASK                       equ 0002h
NCO1ACCL_ACC2_POSN                       equ 0002h
NCO1ACCL_ACC2_POSITION                   equ 0002h
NCO1ACCL_ACC2_SIZE                       equ 0001h
NCO1ACCL_ACC2_LENGTH                     equ 0001h
NCO1ACCL_ACC2_MASK                       equ 0004h
NCO1ACCL_ACC3_POSN                       equ 0003h
NCO1ACCL_ACC3_POSITION                   equ 0003h
NCO1ACCL_ACC3_SIZE                       equ 0001h
NCO1ACCL_ACC3_LENGTH                     equ 0001h
NCO1ACCL_ACC3_MASK                       equ 0008h
NCO1ACCL_ACC4_POSN                       equ 0004h
NCO1ACCL_ACC4_POSITION                   equ 0004h
NCO1ACCL_ACC4_SIZE                       equ 0001h
NCO1ACCL_ACC4_LENGTH                     equ 0001h
NCO1ACCL_ACC4_MASK                       equ 0010h
NCO1ACCL_ACC5_POSN                       equ 0005h
NCO1ACCL_ACC5_POSITION                   equ 0005h
NCO1ACCL_ACC5_SIZE                       equ 0001h
NCO1ACCL_ACC5_LENGTH                     equ 0001h
NCO1ACCL_ACC5_MASK                       equ 0020h
NCO1ACCL_ACC6_POSN                       equ 0006h
NCO1ACCL_ACC6_POSITION                   equ 0006h
NCO1ACCL_ACC6_SIZE                       equ 0001h
NCO1ACCL_ACC6_LENGTH                     equ 0001h
NCO1ACCL_ACC6_MASK                       equ 0040h
NCO1ACCL_ACC7_POSN                       equ 0007h
NCO1ACCL_ACC7_POSITION                   equ 0007h
NCO1ACCL_ACC7_SIZE                       equ 0001h
NCO1ACCL_ACC7_LENGTH                     equ 0001h
NCO1ACCL_ACC7_MASK                       equ 0080h
NCO1ACCL_NCO1ACC_POSN                    equ 0000h
NCO1ACCL_NCO1ACC_POSITION                equ 0000h
NCO1ACCL_NCO1ACC_SIZE                    equ 0008h
NCO1ACCL_NCO1ACC_LENGTH                  equ 0008h
NCO1ACCL_NCO1ACC_MASK                    equ 00FFh

// Register: NCO1ACCH
#define NCO1ACCH NCO1ACCH
NCO1ACCH                                 equ 0441h
// bitfield definitions
NCO1ACCH_ACC_POSN                        equ 0000h
NCO1ACCH_ACC_POSITION                    equ 0000h
NCO1ACCH_ACC_SIZE                        equ 0008h
NCO1ACCH_ACC_LENGTH                      equ 0008h
NCO1ACCH_ACC_MASK                        equ 00FFh
NCO1ACCH_NCO1ACC8_POSN                   equ 0000h
NCO1ACCH_NCO1ACC8_POSITION               equ 0000h
NCO1ACCH_NCO1ACC8_SIZE                   equ 0001h
NCO1ACCH_NCO1ACC8_LENGTH                 equ 0001h
NCO1ACCH_NCO1ACC8_MASK                   equ 0001h
NCO1ACCH_NCO1ACC9_POSN                   equ 0001h
NCO1ACCH_NCO1ACC9_POSITION               equ 0001h
NCO1ACCH_NCO1ACC9_SIZE                   equ 0001h
NCO1ACCH_NCO1ACC9_LENGTH                 equ 0001h
NCO1ACCH_NCO1ACC9_MASK                   equ 0002h
NCO1ACCH_NCO1ACC10_POSN                  equ 0002h
NCO1ACCH_NCO1ACC10_POSITION              equ 0002h
NCO1ACCH_NCO1ACC10_SIZE                  equ 0001h
NCO1ACCH_NCO1ACC10_LENGTH                equ 0001h
NCO1ACCH_NCO1ACC10_MASK                  equ 0004h
NCO1ACCH_NCO1ACC11_POSN                  equ 0003h
NCO1ACCH_NCO1ACC11_POSITION              equ 0003h
NCO1ACCH_NCO1ACC11_SIZE                  equ 0001h
NCO1ACCH_NCO1ACC11_LENGTH                equ 0001h
NCO1ACCH_NCO1ACC11_MASK                  equ 0008h
NCO1ACCH_NCO1ACC12_POSN                  equ 0004h
NCO1ACCH_NCO1ACC12_POSITION              equ 0004h
NCO1ACCH_NCO1ACC12_SIZE                  equ 0001h
NCO1ACCH_NCO1ACC12_LENGTH                equ 0001h
NCO1ACCH_NCO1ACC12_MASK                  equ 0010h
NCO1ACCH_NCO1ACC13_POSN                  equ 0005h
NCO1ACCH_NCO1ACC13_POSITION              equ 0005h
NCO1ACCH_NCO1ACC13_SIZE                  equ 0001h
NCO1ACCH_NCO1ACC13_LENGTH                equ 0001h
NCO1ACCH_NCO1ACC13_MASK                  equ 0020h
NCO1ACCH_NCO1ACC14_POSN                  equ 0006h
NCO1ACCH_NCO1ACC14_POSITION              equ 0006h
NCO1ACCH_NCO1ACC14_SIZE                  equ 0001h
NCO1ACCH_NCO1ACC14_LENGTH                equ 0001h
NCO1ACCH_NCO1ACC14_MASK                  equ 0040h
NCO1ACCH_NCO1ACC15_POSN                  equ 0007h
NCO1ACCH_NCO1ACC15_POSITION              equ 0007h
NCO1ACCH_NCO1ACC15_SIZE                  equ 0001h
NCO1ACCH_NCO1ACC15_LENGTH                equ 0001h
NCO1ACCH_NCO1ACC15_MASK                  equ 0080h
NCO1ACCH_ACC8_POSN                       equ 0000h
NCO1ACCH_ACC8_POSITION                   equ 0000h
NCO1ACCH_ACC8_SIZE                       equ 0001h
NCO1ACCH_ACC8_LENGTH                     equ 0001h
NCO1ACCH_ACC8_MASK                       equ 0001h
NCO1ACCH_ACC9_POSN                       equ 0001h
NCO1ACCH_ACC9_POSITION                   equ 0001h
NCO1ACCH_ACC9_SIZE                       equ 0001h
NCO1ACCH_ACC9_LENGTH                     equ 0001h
NCO1ACCH_ACC9_MASK                       equ 0002h
NCO1ACCH_ACC10_POSN                      equ 0002h
NCO1ACCH_ACC10_POSITION                  equ 0002h
NCO1ACCH_ACC10_SIZE                      equ 0001h
NCO1ACCH_ACC10_LENGTH                    equ 0001h
NCO1ACCH_ACC10_MASK                      equ 0004h
NCO1ACCH_ACC11_POSN                      equ 0003h
NCO1ACCH_ACC11_POSITION                  equ 0003h
NCO1ACCH_ACC11_SIZE                      equ 0001h
NCO1ACCH_ACC11_LENGTH                    equ 0001h
NCO1ACCH_ACC11_MASK                      equ 0008h
NCO1ACCH_ACC12_POSN                      equ 0004h
NCO1ACCH_ACC12_POSITION                  equ 0004h
NCO1ACCH_ACC12_SIZE                      equ 0001h
NCO1ACCH_ACC12_LENGTH                    equ 0001h
NCO1ACCH_ACC12_MASK                      equ 0010h
NCO1ACCH_ACC13_POSN                      equ 0005h
NCO1ACCH_ACC13_POSITION                  equ 0005h
NCO1ACCH_ACC13_SIZE                      equ 0001h
NCO1ACCH_ACC13_LENGTH                    equ 0001h
NCO1ACCH_ACC13_MASK                      equ 0020h
NCO1ACCH_ACC14_POSN                      equ 0006h
NCO1ACCH_ACC14_POSITION                  equ 0006h
NCO1ACCH_ACC14_SIZE                      equ 0001h
NCO1ACCH_ACC14_LENGTH                    equ 0001h
NCO1ACCH_ACC14_MASK                      equ 0040h
NCO1ACCH_ACC15_POSN                      equ 0007h
NCO1ACCH_ACC15_POSITION                  equ 0007h
NCO1ACCH_ACC15_SIZE                      equ 0001h
NCO1ACCH_ACC15_LENGTH                    equ 0001h
NCO1ACCH_ACC15_MASK                      equ 0080h
NCO1ACCH_NCO1ACC_POSN                    equ 0000h
NCO1ACCH_NCO1ACC_POSITION                equ 0000h
NCO1ACCH_NCO1ACC_SIZE                    equ 0008h
NCO1ACCH_NCO1ACC_LENGTH                  equ 0008h
NCO1ACCH_NCO1ACC_MASK                    equ 00FFh

