GopalSaraf/Practicals/PSDL/include/proc/pic18f46q84.inc
// Register: NCO3INCU
#define NCO3INCU NCO3INCU
NCO3INCU                                 equ 0455h
// bitfield definitions
NCO3INCU_INC_POSN                        equ 0000h
NCO3INCU_INC_POSITION                    equ 0000h
NCO3INCU_INC_SIZE                        equ 0004h
NCO3INCU_INC_LENGTH                      equ 0004h
NCO3INCU_INC_MASK                        equ 000Fh
NCO3INCU_NCO3INC16_POSN                  equ 0000h
NCO3INCU_NCO3INC16_POSITION              equ 0000h
NCO3INCU_NCO3INC16_SIZE                  equ 0001h
NCO3INCU_NCO3INC16_LENGTH                equ 0001h
NCO3INCU_NCO3INC16_MASK                  equ 0001h
NCO3INCU_NCO3INC17_POSN                  equ 0001h
NCO3INCU_NCO3INC17_POSITION              equ 0001h
NCO3INCU_NCO3INC17_SIZE                  equ 0001h
NCO3INCU_NCO3INC17_LENGTH                equ 0001h
NCO3INCU_NCO3INC17_MASK                  equ 0002h
NCO3INCU_NCO3INC18_POSN                  equ 0002h
NCO3INCU_NCO3INC18_POSITION              equ 0002h
NCO3INCU_NCO3INC18_SIZE                  equ 0001h
NCO3INCU_NCO3INC18_LENGTH                equ 0001h
NCO3INCU_NCO3INC18_MASK                  equ 0004h
NCO3INCU_NCO3INC19_POSN                  equ 0003h
NCO3INCU_NCO3INC19_POSITION              equ 0003h
NCO3INCU_NCO3INC19_SIZE                  equ 0001h
NCO3INCU_NCO3INC19_LENGTH                equ 0001h
NCO3INCU_NCO3INC19_MASK                  equ 0008h
NCO3INCU_INC16_POSN                      equ 0000h
NCO3INCU_INC16_POSITION                  equ 0000h
NCO3INCU_INC16_SIZE                      equ 0001h
NCO3INCU_INC16_LENGTH                    equ 0001h
NCO3INCU_INC16_MASK                      equ 0001h
NCO3INCU_INC17_POSN                      equ 0001h
NCO3INCU_INC17_POSITION                  equ 0001h
NCO3INCU_INC17_SIZE                      equ 0001h
NCO3INCU_INC17_LENGTH                    equ 0001h
NCO3INCU_INC17_MASK                      equ 0002h
NCO3INCU_INC18_POSN                      equ 0002h
NCO3INCU_INC18_POSITION                  equ 0002h
NCO3INCU_INC18_SIZE                      equ 0001h
NCO3INCU_INC18_LENGTH                    equ 0001h
NCO3INCU_INC18_MASK                      equ 0004h
NCO3INCU_INC19_POSN                      equ 0003h
NCO3INCU_INC19_POSITION                  equ 0003h
NCO3INCU_INC19_SIZE                      equ 0001h
NCO3INCU_INC19_LENGTH                    equ 0001h
NCO3INCU_INC19_MASK                      equ 0008h
NCO3INCU_NCO3INC_POSN                    equ 0000h
NCO3INCU_NCO3INC_POSITION                equ 0000h
NCO3INCU_NCO3INC_SIZE                    equ 0004h
NCO3INCU_NCO3INC_LENGTH                  equ 0004h
NCO3INCU_NCO3INC_MASK                    equ 000Fh

// Register: NCO3CON
#define NCO3CON NCO3CON
NCO3CON                                  equ 0456h
// bitfield definitions
NCO3CON_PFM_POSN                         equ 0000h
NCO3CON_PFM_POSITION                     equ 0000h
NCO3CON_PFM_SIZE                         equ 0001h
NCO3CON_PFM_LENGTH                       equ 0001h
NCO3CON_PFM_MASK                         equ 0001h
NCO3CON_POL_POSN                         equ 0004h
NCO3CON_POL_POSITION                     equ 0004h
NCO3CON_POL_SIZE                         equ 0001h
NCO3CON_POL_LENGTH                       equ 0001h
NCO3CON_POL_MASK                         equ 0010h
NCO3CON_OUT_POSN                         equ 0005h
NCO3CON_OUT_POSITION                     equ 0005h
NCO3CON_OUT_SIZE                         equ 0001h
NCO3CON_OUT_LENGTH                       equ 0001h
NCO3CON_OUT_MASK                         equ 0020h
NCO3CON_EN_POSN                          equ 0007h
NCO3CON_EN_POSITION                      equ 0007h
NCO3CON_EN_SIZE                          equ 0001h
NCO3CON_EN_LENGTH                        equ 0001h
NCO3CON_EN_MASK                          equ 0080h
NCO3CON_NCO3PFM_POSN                     equ 0000h
NCO3CON_NCO3PFM_POSITION                 equ 0000h
NCO3CON_NCO3PFM_SIZE                     equ 0001h
NCO3CON_NCO3PFM_LENGTH                   equ 0001h
NCO3CON_NCO3PFM_MASK                     equ 0001h
NCO3CON_NCO3POL_POSN                     equ 0004h
NCO3CON_NCO3POL_POSITION                 equ 0004h
NCO3CON_NCO3POL_SIZE                     equ 0001h
NCO3CON_NCO3POL_LENGTH                   equ 0001h
NCO3CON_NCO3POL_MASK                     equ 0010h
NCO3CON_NCO3OUT_POSN                     equ 0005h
NCO3CON_NCO3OUT_POSITION                 equ 0005h
NCO3CON_NCO3OUT_SIZE                     equ 0001h
NCO3CON_NCO3OUT_LENGTH                   equ 0001h
NCO3CON_NCO3OUT_MASK                     equ 0020h
NCO3CON_NCO3EN_POSN                      equ 0007h
NCO3CON_NCO3EN_POSITION                  equ 0007h
NCO3CON_NCO3EN_SIZE                      equ 0001h
NCO3CON_NCO3EN_LENGTH                    equ 0001h
NCO3CON_NCO3EN_MASK                      equ 0080h

// Register: NCO3CLK
#define NCO3CLK NCO3CLK
NCO3CLK                                  equ 0457h
// bitfield definitions
NCO3CLK_CKS_POSN                         equ 0000h
NCO3CLK_CKS_POSITION                     equ 0000h
NCO3CLK_CKS_SIZE                         equ 0004h
NCO3CLK_CKS_LENGTH                       equ 0004h
NCO3CLK_CKS_MASK                         equ 000Fh
NCO3CLK_PWS_POSN                         equ 0005h
NCO3CLK_PWS_POSITION                     equ 0005h
NCO3CLK_PWS_SIZE                         equ 0003h
NCO3CLK_PWS_LENGTH                       equ 0003h
NCO3CLK_PWS_MASK                         equ 00E0h
NCO3CLK_CKS0_POSN                        equ 0000h
NCO3CLK_CKS0_POSITION                    equ 0000h
NCO3CLK_CKS0_SIZE                        equ 0001h
NCO3CLK_CKS0_LENGTH                      equ 0001h
NCO3CLK_CKS0_MASK                        equ 0001h
NCO3CLK_CKS1_POSN                        equ 0001h
NCO3CLK_CKS1_POSITION                    equ 0001h
NCO3CLK_CKS1_SIZE                        equ 0001h
NCO3CLK_CKS1_LENGTH                      equ 0001h
NCO3CLK_CKS1_MASK                        equ 0002h
NCO3CLK_CKS2_POSN                        equ 0002h
NCO3CLK_CKS2_POSITION                    equ 0002h
NCO3CLK_CKS2_SIZE                        equ 0001h
NCO3CLK_CKS2_LENGTH                      equ 0001h
NCO3CLK_CKS2_MASK                        equ 0004h
NCO3CLK_CKS3_POSN                        equ 0003h
NCO3CLK_CKS3_POSITION                    equ 0003h
NCO3CLK_CKS3_SIZE                        equ 0001h
NCO3CLK_CKS3_LENGTH                      equ 0001h
NCO3CLK_CKS3_MASK                        equ 0008h
NCO3CLK_PWS0_POSN                        equ 0005h
NCO3CLK_PWS0_POSITION                    equ 0005h
NCO3CLK_PWS0_SIZE                        equ 0001h
NCO3CLK_PWS0_LENGTH                      equ 0001h
NCO3CLK_PWS0_MASK                        equ 0020h
NCO3CLK_PWS1_POSN                        equ 0006h
NCO3CLK_PWS1_POSITION                    equ 0006h
NCO3CLK_PWS1_SIZE                        equ 0001h
NCO3CLK_PWS1_LENGTH                      equ 0001h
NCO3CLK_PWS1_MASK                        equ 0040h
NCO3CLK_PWS2_POSN                        equ 0007h
NCO3CLK_PWS2_POSITION                    equ 0007h
NCO3CLK_PWS2_SIZE                        equ 0001h
NCO3CLK_PWS2_LENGTH                      equ 0001h
NCO3CLK_PWS2_MASK                        equ 0080h
NCO3CLK_NCO3CKS_POSN                     equ 0000h
NCO3CLK_NCO3CKS_POSITION                 equ 0000h
NCO3CLK_NCO3CKS_SIZE                     equ 0004h
NCO3CLK_NCO3CKS_LENGTH                   equ 0004h
NCO3CLK_NCO3CKS_MASK                     equ 000Fh
NCO3CLK_NCO3PWS_POSN                     equ 0005h
NCO3CLK_NCO3PWS_POSITION                 equ 0005h
NCO3CLK_NCO3PWS_SIZE                     equ 0003h
NCO3CLK_NCO3PWS_LENGTH                   equ 0003h
NCO3CLK_NCO3PWS_MASK                     equ 00E0h
NCO3CLK_NCO3CKS0_POSN                    equ 0000h
NCO3CLK_NCO3CKS0_POSITION                equ 0000h
NCO3CLK_NCO3CKS0_SIZE                    equ 0001h
NCO3CLK_NCO3CKS0_LENGTH                  equ 0001h
NCO3CLK_NCO3CKS0_MASK                    equ 0001h
NCO3CLK_NCO3CKS1_POSN                    equ 0001h
NCO3CLK_NCO3CKS1_POSITION                equ 0001h
NCO3CLK_NCO3CKS1_SIZE                    equ 0001h
NCO3CLK_NCO3CKS1_LENGTH                  equ 0001h
NCO3CLK_NCO3CKS1_MASK                    equ 0002h
NCO3CLK_NCO3CKS2_POSN                    equ 0002h
NCO3CLK_NCO3CKS2_POSITION                equ 0002h
NCO3CLK_NCO3CKS2_SIZE                    equ 0001h
NCO3CLK_NCO3CKS2_LENGTH                  equ 0001h
NCO3CLK_NCO3CKS2_MASK                    equ 0004h
NCO3CLK_NCO3CKS3_POSN                    equ 0003h
NCO3CLK_NCO3CKS3_POSITION                equ 0003h
NCO3CLK_NCO3CKS3_SIZE                    equ 0001h
NCO3CLK_NCO3CKS3_LENGTH                  equ 0001h
NCO3CLK_NCO3CKS3_MASK                    equ 0008h
NCO3CLK_NCO3PWS0_POSN                    equ 0005h
NCO3CLK_NCO3PWS0_POSITION                equ 0005h
NCO3CLK_NCO3PWS0_SIZE                    equ 0001h
NCO3CLK_NCO3PWS0_LENGTH                  equ 0001h
NCO3CLK_NCO3PWS0_MASK                    equ 0020h
NCO3CLK_NCO3PWS1_POSN                    equ 0006h
NCO3CLK_NCO3PWS1_POSITION                equ 0006h
NCO3CLK_NCO3PWS1_SIZE                    equ 0001h
NCO3CLK_NCO3PWS1_LENGTH                  equ 0001h
NCO3CLK_NCO3PWS1_MASK                    equ 0040h
NCO3CLK_NCO3PWS2_POSN                    equ 0007h
NCO3CLK_NCO3PWS2_POSITION                equ 0007h
NCO3CLK_NCO3PWS2_SIZE                    equ 0001h
NCO3CLK_NCO3PWS2_LENGTH                  equ 0001h
NCO3CLK_NCO3PWS2_MASK                    equ 0080h

// Register: FSCMCON
#define FSCMCON FSCMCON
FSCMCON                                  equ 0458h
// bitfield definitions
FSCMCON_FSCMFEV_POSN                     equ 0000h
FSCMCON_FSCMFEV_POSITION                 equ 0000h
FSCMCON_FSCMFEV_SIZE                     equ 0001h
FSCMCON_FSCMFEV_LENGTH                   equ 0001h
FSCMCON_FSCMFEV_MASK                     equ 0001h
FSCMCON_FSCMFFI_POSN                     equ 0001h
FSCMCON_FSCMFFI_POSITION                 equ 0001h
FSCMCON_FSCMFFI_SIZE                     equ 0001h
FSCMCON_FSCMFFI_LENGTH                   equ 0001h
FSCMCON_FSCMFFI_MASK                     equ 0002h
FSCMCON_FSCMPEV_POSN                     equ 0002h
FSCMCON_FSCMPEV_POSITION                 equ 0002h
FSCMCON_FSCMPEV_SIZE                     equ 0001h
FSCMCON_FSCMPEV_LENGTH                   equ 0001h
FSCMCON_FSCMPEV_MASK                     equ 0004h
FSCMCON_FSCMPFI_POSN                     equ 0003h
FSCMCON_FSCMPFI_POSITION                 equ 0003h
FSCMCON_FSCMPFI_SIZE                     equ 0001h
FSCMCON_FSCMPFI_LENGTH                   equ 0001h
FSCMCON_FSCMPFI_MASK                     equ 0008h
FSCMCON_FSCMSEV_POSN                     equ 0004h
FSCMCON_FSCMSEV_POSITION                 equ 0004h
FSCMCON_FSCMSEV_SIZE                     equ 0001h
FSCMCON_FSCMSEV_LENGTH                   equ 0001h
FSCMCON_FSCMSEV_MASK                     equ 0010h
FSCMCON_FSCMSFI_POSN                     equ 0005h
FSCMCON_FSCMSFI_POSITION                 equ 0005h
FSCMCON_FSCMSFI_SIZE                     equ 0001h
FSCMCON_FSCMSFI_LENGTH                   equ 0001h
FSCMCON_FSCMSFI_MASK                     equ 0020h

// Register: IVTLOCK
#define IVTLOCK IVTLOCK
IVTLOCK                                  equ 0459h
// bitfield definitions
IVTLOCK_IVTLOCKED_POSN                   equ 0000h
IVTLOCK_IVTLOCKED_POSITION               equ 0000h
IVTLOCK_IVTLOCKED_SIZE                   equ 0001h
IVTLOCK_IVTLOCKED_LENGTH                 equ 0001h
IVTLOCK_IVTLOCKED_MASK                   equ 0001h

