GopalSaraf/Practicals/PSDL/include/proc/pic18f46q84.inc
#define DMA6ORIF                         BANKMASK(PIR13), 6, a
#define DMA6ORIP                         BANKMASK(IPR13), 6, b
#define DMA6PR0                          BANKMASK(DMA6PR), 0, b
#define DMA6PR1                          BANKMASK(DMA6PR), 1, b
#define DMA6PR2                          BANKMASK(DMA6PR), 2, b
#define DMA6SCNTIE                       BANKMASK(PIE13), 4, a
#define DMA6SCNTIF                       BANKMASK(PIR13), 4, a
#define DMA6SCNTIP                       BANKMASK(IPR13), 4, b
#define DMA7AIE                          BANKMASK(PIE14), 7, a
#define DMA7AIF                          BANKMASK(PIR14), 7, a
#define DMA7AIP                          BANKMASK(IPR14), 7, b
#define DMA7DCNTIE                       BANKMASK(PIE14), 5, a
#define DMA7DCNTIF                       BANKMASK(PIR14), 5, a
#define DMA7DCNTIP                       BANKMASK(IPR14), 5, b
#define DMA7MD                           BANKMASK(PMD8), 6, b
#define DMA7ORIE                         BANKMASK(PIE14), 6, a
#define DMA7ORIF                         BANKMASK(PIR14), 6, a
#define DMA7ORIP                         BANKMASK(IPR14), 6, b
#define DMA7PR0                          BANKMASK(DMA7PR), 0, b
#define DMA7PR1                          BANKMASK(DMA7PR), 1, b
#define DMA7PR2                          BANKMASK(DMA7PR), 2, b
#define DMA7SCNTIE                       BANKMASK(PIE14), 4, a
#define DMA7SCNTIF                       BANKMASK(PIR14), 4, a
#define DMA7SCNTIP                       BANKMASK(IPR14), 4, b
#define DMA8AIE                          BANKMASK(PIE15), 7, a
#define DMA8AIF                          BANKMASK(PIR15), 7, a
#define DMA8AIP                          BANKMASK(IPR15), 7, b
#define DMA8DCNTIE                       BANKMASK(PIE15), 5, a
#define DMA8DCNTIF                       BANKMASK(PIR15), 5, a
#define DMA8DCNTIP                       BANKMASK(IPR15), 5, b
#define DMA8MD                           BANKMASK(PMD8), 7, b
#define DMA8ORIE                         BANKMASK(PIE15), 6, a
#define DMA8ORIF                         BANKMASK(PIR15), 6, a
#define DMA8ORIP                         BANKMASK(IPR15), 6, b
#define DMA8PR0                          BANKMASK(DMA8PR), 0, b
#define DMA8PR1                          BANKMASK(DMA8PR), 1, b
#define DMA8PR2                          BANKMASK(DMA8PR), 2, b
#define DMA8SCNTIE                       BANKMASK(PIE15), 4, a
#define DMA8SCNTIF                       BANKMASK(PIR15), 4, a
#define DMA8SCNTIP                       BANKMASK(IPR15), 4, b
#define DNCNT0                           BANKMASK(C1CONL), 0, b
#define DNCNT1                           BANKMASK(C1CONL), 1, b
#define DNCNT2                           BANKMASK(C1CONL), 2, b
#define DNCNT3                           BANKMASK(C1CONL), 3, b
#define DNCNT4                           BANKMASK(C1CONL), 4, b
#define DOE                              BANKMASK(CPUDOZE), 4, a
#define DONE                             BANKMASK(ADCON0), 0, b
#define DOZE0                            BANKMASK(CPUDOZE), 0, a
#define DOZE1                            BANKMASK(CPUDOZE), 1, a
#define DOZE2                            BANKMASK(CPUDOZE), 2, a
#define DOZEN                            BANKMASK(CPUDOZE), 6, a
#define DPTR0                            BANKMASK(DMAnDPTRL), 0, b
#define DPTR1                            BANKMASK(DMAnDPTRL), 1, b
#define DPTR10                           BANKMASK(DMAnDPTRH), 2, b
#define DPTR11                           BANKMASK(DMAnDPTRH), 3, b
#define DPTR12                           BANKMASK(DMAnDPTRH), 4, b
#define DPTR13                           BANKMASK(DMAnDPTRH), 5, b
#define DPTR14                           BANKMASK(DMAnDPTRH), 6, b
#define DPTR15                           BANKMASK(DMAnDPTRH), 7, b
#define DPTR2                            BANKMASK(DMAnDPTRL), 2, b
#define DPTR3                            BANKMASK(DMAnDPTRL), 3, b
#define DPTR4                            BANKMASK(DMAnDPTRL), 4, b
#define DPTR5                            BANKMASK(DMAnDPTRL), 5, b
#define DPTR6                            BANKMASK(DMAnDPTRL), 6, b
#define DPTR7                            BANKMASK(DMAnDPTRL), 7, b
#define DPTR8                            BANKMASK(DMAnDPTRH), 0, b
#define DPTR9                            BANKMASK(DMAnDPTRH), 1, b
#define DRERRCNT0                        BANKMASK(C1BDIAG0U), 0, b
#define DRERRCNT1                        BANKMASK(C1BDIAG0U), 1, b
#define DRERRCNT2                        BANKMASK(C1BDIAG0U), 2, b
#define DRERRCNT3                        BANKMASK(C1BDIAG0U), 3, b
#define DRERRCNT4                        BANKMASK(C1BDIAG0U), 4, b
#define DRERRCNT5                        BANKMASK(C1BDIAG0U), 5, b
#define DRERRCNT6                        BANKMASK(C1BDIAG0U), 6, b
#define DRERRCNT7                        BANKMASK(C1BDIAG0U), 7, b
#define DSA0                             BANKMASK(DMAnDSAL), 0, b
#define DSA1                             BANKMASK(DMAnDSAL), 1, b
#define DSA10                            BANKMASK(DMAnDSAH), 2, b
#define DSA11                            BANKMASK(DMAnDSAH), 3, b
#define DSA12                            BANKMASK(DMAnDSAH), 4, b
#define DSA13                            BANKMASK(DMAnDSAH), 5, b
#define DSA14                            BANKMASK(DMAnDSAH), 6, b
#define DSA15                            BANKMASK(DMAnDSAH), 7, b
#define DSA2                             BANKMASK(DMAnDSAL), 2, b
#define DSA3                             BANKMASK(DMAnDSAL), 3, b
#define DSA4                             BANKMASK(DMAnDSAL), 4, b
#define DSA5                             BANKMASK(DMAnDSAL), 5, b
#define DSA6                             BANKMASK(DMAnDSAL), 6, b
#define DSA7                             BANKMASK(DMAnDSAL), 7, b
#define DSA8                             BANKMASK(DMAnDSAH), 0, b
#define DSA9                             BANKMASK(DMAnDSAH), 1, b
#define DSEN                             BANKMASK(ADCON1), 0, b
#define DSM1MD                           BANKMASK(PMD4), 3, b
#define DSTP                             BANKMASK(DMAnCON1), 5, b
#define DSTUFERR                         BANKMASK(C1BDIAG1T), 4, b
#define DSZ0                             BANKMASK(DMAnDSZL), 0, b
#define DSZ1                             BANKMASK(DMAnDSZL), 1, b
#define DSZ10                            BANKMASK(DMAnDSZH), 2, b
#define DSZ11                            BANKMASK(DMAnDSZH), 3, b
#define DSZ2                             BANKMASK(DMAnDSZL), 2, b
#define DSZ3                             BANKMASK(DMAnDSZL), 3, b
#define DSZ4                             BANKMASK(DMAnDSZL), 4, b
#define DSZ5                             BANKMASK(DMAnDSZL), 5, b
#define DSZ6                             BANKMASK(DMAnDSZL), 6, b
#define DSZ7                             BANKMASK(DMAnDSZL), 7, b
#define DSZ8                             BANKMASK(DMAnDSZH), 0, b
#define DSZ9                             BANKMASK(DMAnDSZH), 1, b
#define DTERRCNT0                        BANKMASK(C1BDIAG0T), 0, b
#define DTERRCNT1                        BANKMASK(C1BDIAG0T), 1, b
#define DTERRCNT2                        BANKMASK(C1BDIAG0T), 2, b
#define DTERRCNT3                        BANKMASK(C1BDIAG0T), 3, b
#define DTERRCNT4                        BANKMASK(C1BDIAG0T), 4, b
#define DTERRCNT5                        BANKMASK(C1BDIAG0T), 5, b
#define DTERRCNT6                        BANKMASK(C1BDIAG0T), 6, b
#define DTERRCNT7                        BANKMASK(C1BDIAG0T), 7, b
#define EDGFLTEN                         BANKMASK(C1TDCT), 1, b
#define EFMSGCNT0                        BANKMASK(C1BDIAG1L), 0, b
#define EFMSGCNT1                        BANKMASK(C1BDIAG1L), 1, b
#define EFMSGCNT10                       BANKMASK(C1BDIAG1H), 2, b
#define EFMSGCNT11                       BANKMASK(C1BDIAG1H), 3, b
#define EFMSGCNT12                       BANKMASK(C1BDIAG1H), 4, b
#define EFMSGCNT13                       BANKMASK(C1BDIAG1H), 5, b
#define EFMSGCNT14                       BANKMASK(C1BDIAG1H), 6, b
#define EFMSGCNT15                       BANKMASK(C1BDIAG1H), 7, b
#define EFMSGCNT2                        BANKMASK(C1BDIAG1L), 2, b
#define EFMSGCNT3                        BANKMASK(C1BDIAG1L), 3, b
#define EFMSGCNT4                        BANKMASK(C1BDIAG1L), 4, b
#define EFMSGCNT5                        BANKMASK(C1BDIAG1L), 5, b
#define EFMSGCNT6                        BANKMASK(C1BDIAG1L), 6, b
#define EFMSGCNT7                        BANKMASK(C1BDIAG1L), 7, b
#define EFMSGCNT8                        BANKMASK(C1BDIAG1H), 0, b
#define EFMSGCNT9                        BANKMASK(C1BDIAG1H), 1, b
#define ERR0                             BANKMASK(ADERRL), 0, b
#define ERR1                             BANKMASK(ADERRL), 1, b
#define ERR10                            BANKMASK(ADERRH), 2, b
#define ERR11                            BANKMASK(ADERRH), 3, b
#define ERR12                            BANKMASK(ADERRH), 4, b
#define ERR13                            BANKMASK(ADERRH), 5, b
#define ERR14                            BANKMASK(ADERRH), 6, b
#define ERR15                            BANKMASK(ADERRH), 7, b
#define ERR2                             BANKMASK(ADERRL), 2, b
#define ERR3                             BANKMASK(ADERRL), 3, b
#define ERR4                             BANKMASK(ADERRL), 4, b
#define ERR5                             BANKMASK(ADERRL), 5, b
#define ERR6                             BANKMASK(ADERRL), 6, b
#define ERR7                             BANKMASK(ADERRL), 7, b
#define ERR8                             BANKMASK(ADERRH), 0, b
#define ERR9                             BANKMASK(ADERRH), 1, b
#define ESI                              BANKMASK(C1BDIAG1T), 6, b
#define ESIGM                            BANKMASK(C1CONU), 1, b
#define EWARN                            BANKMASK(C1TRECU), 0, b
#define EXTOEN                           BANKMASK(OSCEN), 7, b
#define EXTOR                            BANKMASK(OSCSTAT), 7, b
#define F0BP0                            BANKMASK(C1FLTCON0L), 0, b
#define F0BP1                            BANKMASK(C1FLTCON0L), 1, b
#define F0BP2                            BANKMASK(C1FLTCON0L), 2, b
#define F0BP3                            BANKMASK(C1FLTCON0L), 3, b
#define F0BP4                            BANKMASK(C1FLTCON0L), 4, b
#define F10BP0                           BANKMASK(C1FLTCON2U), 0, b
#define F10BP1                           BANKMASK(C1FLTCON2U), 1, b
#define F10BP2                           BANKMASK(C1FLTCON2U), 2, b
#define F10BP3                           BANKMASK(C1FLTCON2U), 3, b
#define F10BP4                           BANKMASK(C1FLTCON2U), 4, b
#define F11BP0                           BANKMASK(C1FLTCON2T), 0, b
#define F11BP1                           BANKMASK(C1FLTCON2T), 1, b
#define F11BP2                           BANKMASK(C1FLTCON2T), 2, b
#define F11BP3                           BANKMASK(C1FLTCON2T), 3, b
#define F11BP4                           BANKMASK(C1FLTCON2T), 4, b
#define F1BP0                            BANKMASK(C1FLTCON0H), 0, b
#define F1BP1                            BANKMASK(C1FLTCON0H), 1, b
#define F1BP2                            BANKMASK(C1FLTCON0H), 2, b
#define F1BP3                            BANKMASK(C1FLTCON0H), 3, b
#define F1BP4                            BANKMASK(C1FLTCON0H), 4, b
#define F2BP0                            BANKMASK(C1FLTCON0U), 0, b
#define F2BP1                            BANKMASK(C1FLTCON0U), 1, b
#define F2BP2                            BANKMASK(C1FLTCON0U), 2, b
#define F2BP3                            BANKMASK(C1FLTCON0U), 3, b
#define F2BP4                            BANKMASK(C1FLTCON0U), 4, b
#define F3BP0                            BANKMASK(C1FLTCON0T), 0, b
#define F3BP1                            BANKMASK(C1FLTCON0T), 1, b
#define F3BP2                            BANKMASK(C1FLTCON0T), 2, b
#define F3BP3                            BANKMASK(C1FLTCON0T), 3, b
#define F3BP4                            BANKMASK(C1FLTCON0T), 4, b
#define F4BP0                            BANKMASK(C1FLTCON1L), 0, b
#define F4BP1                            BANKMASK(C1FLTCON1L), 1, b
#define F4BP2                            BANKMASK(C1FLTCON1L), 2, b
#define F4BP3                            BANKMASK(C1FLTCON1L), 3, b
#define F4BP4                            BANKMASK(C1FLTCON1L), 4, b
#define F5BP0                            BANKMASK(C1FLTCON1H), 0, b
#define F5BP1                            BANKMASK(C1FLTCON1H), 1, b
#define F5BP2                            BANKMASK(C1FLTCON1H), 2, b
#define F5BP3                            BANKMASK(C1FLTCON1H), 3, b
#define F5BP4                            BANKMASK(C1FLTCON1H), 4, b
#define F6BP0                            BANKMASK(C1FLTCON1U), 0, b
#define F6BP1                            BANKMASK(C1FLTCON1U), 1, b
#define F6BP2                            BANKMASK(C1FLTCON1U), 2, b
#define F6BP3                            BANKMASK(C1FLTCON1U), 3, b
#define F6BP4                            BANKMASK(C1FLTCON1U), 4, b
#define F7BP0                            BANKMASK(C1FLTCON1T), 0, b
#define F7BP1                            BANKMASK(C1FLTCON1T), 1, b
#define F7BP2                            BANKMASK(C1FLTCON1T), 2, b
#define F7BP3                            BANKMASK(C1FLTCON1T), 3, b
#define F7BP4                            BANKMASK(C1FLTCON1T), 4, b
#define F8BP0                            BANKMASK(C1FLTCON2L), 0, b
#define F8BP1                            BANKMASK(C1FLTCON2L), 1, b
#define F8BP2                            BANKMASK(C1FLTCON2L), 2, b
#define F8BP3                            BANKMASK(C1FLTCON2L), 3, b
#define F8BP4                            BANKMASK(C1FLTCON2L), 4, b
#define F9BP0                            BANKMASK(C1FLTCON2H), 0, b
#define F9BP1                            BANKMASK(C1FLTCON2H), 1, b
#define F9BP2                            BANKMASK(C1FLTCON2H), 2, b
#define F9BP3                            BANKMASK(C1FLTCON2H), 3, b
#define F9BP4                            BANKMASK(C1FLTCON2H), 4, b
#define FIFOBA0                          BANKMASK(C1FIFOBAL), 0, b
#define FIFOBA1                          BANKMASK(C1FIFOBAL), 1, b
#define FIFOBA10                         BANKMASK(C1FIFOBAH), 2, b
#define FIFOBA11                         BANKMASK(C1FIFOBAH), 3, b
#define FIFOBA12                         BANKMASK(C1FIFOBAH), 4, b
#define FIFOBA13                         BANKMASK(C1FIFOBAH), 5, b
#define FIFOBA14                         BANKMASK(C1FIFOBAH), 6, b
#define FIFOBA15                         BANKMASK(C1FIFOBAH), 7, b
#define FIFOBA16                         BANKMASK(C1FIFOBAU), 0, b
#define FIFOBA17                         BANKMASK(C1FIFOBAU), 1, b
#define FIFOBA18                         BANKMASK(C1FIFOBAU), 2, b
#define FIFOBA19                         BANKMASK(C1FIFOBAU), 3, b
#define FIFOBA2                          BANKMASK(C1FIFOBAL), 2, b
#define FIFOBA20                         BANKMASK(C1FIFOBAU), 4, b
#define FIFOBA21                         BANKMASK(C1FIFOBAU), 5, b
#define FIFOBA22                         BANKMASK(C1FIFOBAU), 6, b
#define FIFOBA23                         BANKMASK(C1FIFOBAU), 7, b
#define FIFOBA24                         BANKMASK(C1FIFOBAT), 0, b
#define FIFOBA25                         BANKMASK(C1FIFOBAT), 1, b
#define FIFOBA26                         BANKMASK(C1FIFOBAT), 2, b
#define FIFOBA27                         BANKMASK(C1FIFOBAT), 3, b
#define FIFOBA28                         BANKMASK(C1FIFOBAT), 4, b
#define FIFOBA29                         BANKMASK(C1FIFOBAT), 5, b
#define FIFOBA3                          BANKMASK(C1FIFOBAL), 3, b
#define FIFOBA30                         BANKMASK(C1FIFOBAT), 6, b
#define FIFOBA31                         BANKMASK(C1FIFOBAT), 7, b
#define FIFOBA4                          BANKMASK(C1FIFOBAL), 4, b
#define FIFOBA5                          BANKMASK(C1FIFOBAL), 5, b
#define FIFOBA6                          BANKMASK(C1FIFOBAL), 6, b
#define FIFOBA7                          BANKMASK(C1FIFOBAL), 7, b
#define FIFOBA8                          BANKMASK(C1FIFOBAH), 0, b
#define FIFOBA9                          BANKMASK(C1FIFOBAH), 1, b
#define FLTEN0                           BANKMASK(C1FLTCON0L), 7, b
#define FLTEN1                           BANKMASK(C1FLTCON0H), 7, b
#define FLTEN10                          BANKMASK(C1FLTCON2U), 7, b
#define FLTEN11                          BANKMASK(C1FLTCON2T), 7, b
#define FLTEN2                           BANKMASK(C1FLTCON0U), 7, b
#define FLTEN3                           BANKMASK(C1FLTCON0T), 7, b
#define FLTEN4                           BANKMASK(C1FLTCON1L), 7, b
#define FLTEN5                           BANKMASK(C1FLTCON1H), 7, b
#define FLTEN6                           BANKMASK(C1FLTCON1U), 7, b
#define FLTEN7                           BANKMASK(C1FLTCON1T), 7, b
#define FLTEN8                           BANKMASK(C1FLTCON2L), 7, b
#define FLTEN9                           BANKMASK(C1FLTCON2H), 7, b
#define FLTR0                            BANKMASK(ADFLTRL), 0, b
#define FLTR1                            BANKMASK(ADFLTRL), 1, b
#define FLTR10                           BANKMASK(ADFLTRH), 2, b
#define FLTR11                           BANKMASK(ADFLTRH), 3, b
#define FLTR12                           BANKMASK(ADFLTRH), 4, b
#define FLTR13                           BANKMASK(ADFLTRH), 5, b
#define FLTR14                           BANKMASK(ADFLTRH), 6, b
#define FLTR15                           BANKMASK(ADFLTRH), 7, b
#define FLTR2                            BANKMASK(ADFLTRL), 2, b
#define FLTR3                            BANKMASK(ADFLTRL), 3, b
#define FLTR4                            BANKMASK(ADFLTRL), 4, b
#define FLTR5                            BANKMASK(ADFLTRL), 5, b
#define FLTR6                            BANKMASK(ADFLTRL), 6, b
#define FLTR7                            BANKMASK(ADFLTRL), 7, b
#define FLTR8                            BANKMASK(ADFLTRH), 0, b
#define FLTR9                            BANKMASK(ADFLTRH), 1, b
#define FM0                              BANKMASK(ADCON0), 2, b
#define FME                              BANKMASK(I2C1CON2), 5, b
#define FRQ0                             BANKMASK(OSCFRQ), 0, b
#define FRQ1                             BANKMASK(OSCFRQ), 1, b
#define FRQ2                             BANKMASK(OSCFRQ), 2, b
#define FRQ3                             BANKMASK(OSCFRQ), 3, b
#define FRZ                              BANKMASK(C1CONH), 6, b
#define FSCMFEV                          BANKMASK(FSCMCON), 0, b
#define FSCMFFI                          BANKMASK(FSCMCON), 1, b
#define FSCMPEV                          BANKMASK(FSCMCON), 2, b
#define FSCMPFI                          BANKMASK(FSCMCON), 3, b
#define FSCMSEV                          BANKMASK(FSCMCON), 4, b
#define FSCMSFI                          BANKMASK(FSCMCON), 5, b
#define FULL                             BANKMASK(CRCCON0), 0, b
#define FVREN                            BANKMASK(FVRCON), 7, b
#define FVRMD                            BANKMASK(PMD0), 6, b
#define FVRRDY                           BANKMASK(FVRCON), 6, b
#define G1D1N                            BANKMASK(CLCnGLS0), 0, b
#define G1D1T                            BANKMASK(CLCnGLS0), 1, b
#define G1D2N                            BANKMASK(CLCnGLS0), 2, b
#define G1D2T                            BANKMASK(CLCnGLS0), 3, b
#define G1D3N                            BANKMASK(CLCnGLS0), 4, b
#define G1D3T                            BANKMASK(CLCnGLS0), 5, b
#define G1D4N                            BANKMASK(CLCnGLS0), 6, b
#define G1D4T                            BANKMASK(CLCnGLS0), 7, b
#define G1EN                             BANKMASK(CWG1CON0), 7, b
#define G1POL                            BANKMASK(CLCnPOL), 0, b
#define G2D1N                            BANKMASK(CLCnGLS1), 0, b
#define G2D1T                            BANKMASK(CLCnGLS1), 1, b
#define G2D2N                            BANKMASK(CLCnGLS1), 2, b
#define G2D2T                            BANKMASK(CLCnGLS1), 3, b
#define G2D3N                            BANKMASK(CLCnGLS1), 4, b
#define G2D3T                            BANKMASK(CLCnGLS1), 5, b
#define G2D4N                            BANKMASK(CLCnGLS1), 6, b
#define G2D4T                            BANKMASK(CLCnGLS1), 7, b
#define G2EN                             BANKMASK(CWG2CON0), 7, b
#define G2POL                            BANKMASK(CLCnPOL), 1, b
#define G3D1N                            BANKMASK(CLCnGLS2), 0, b
#define G3D1T                            BANKMASK(CLCnGLS2), 1, b
#define G3D2N                            BANKMASK(CLCnGLS2), 2, b
#define G3D2T                            BANKMASK(CLCnGLS2), 3, b
#define G3D3N                            BANKMASK(CLCnGLS2), 4, b
#define G3D3T                            BANKMASK(CLCnGLS2), 5, b
#define G3D4N                            BANKMASK(CLCnGLS2), 6, b
#define G3D4T                            BANKMASK(CLCnGLS2), 7, b
#define G3EN                             BANKMASK(CWG3CON0), 7, b
#define G3POL                            BANKMASK(CLCnPOL), 2, b
#define G4D1N                            BANKMASK(CLCnGLS3), 0, b
#define G4D1T                            BANKMASK(CLCnGLS3), 1, b
#define G4D2N                            BANKMASK(CLCnGLS3), 2, b
#define G4D2T                            BANKMASK(CLCnGLS3), 3, b
#define G4D3N                            BANKMASK(CLCnGLS3), 4, b
#define G4D3T                            BANKMASK(CLCnGLS3), 5, b
#define G4D4N                            BANKMASK(CLCnGLS3), 6, b
#define G4D4T                            BANKMASK(CLCnGLS3), 7, b
#define G4POL                            BANKMASK(CLCnPOL), 3, b
#define GCEN                             BANKMASK(I2C1CON2), 6, b
#define GIE                              BANKMASK(INTCON0), 7, a
#define GIEH                             BANKMASK(INTCON0), 7, a
#define GIEL                             BANKMASK(INTCON0), 6, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 0, b
#define GO_nDONE                         BANKMASK(ADCON0), 0, b
#define HADR0                            BANKMASK(SCANHADRL), 0, b
#define HADR1                            BANKMASK(SCANHADRL), 1, b
#define HADR10                           BANKMASK(SCANHADRH), 2, b
#define HADR11                           BANKMASK(SCANHADRH), 3, b
#define HADR12                           BANKMASK(SCANHADRH), 4, b
#define HADR13                           BANKMASK(SCANHADRH), 5, b
#define HADR14                           BANKMASK(SCANHADRH), 6, b
#define HADR15                           BANKMASK(SCANHADRH), 7, b
#define HADR16                           BANKMASK(SCANHADRU), 0, b
#define HADR17                           BANKMASK(SCANHADRU), 1, b
#define HADR18                           BANKMASK(SCANHADRU), 2, b
#define HADR19                           BANKMASK(SCANHADRU), 3, b
#define HADR2                            BANKMASK(SCANHADRL), 2, b
#define HADR20                           BANKMASK(SCANHADRU), 4, b
#define HADR21                           BANKMASK(SCANHADRU), 5, b
#define HADR3                            BANKMASK(SCANHADRL), 3, b
#define HADR4                            BANKMASK(SCANHADRL), 4, b
#define HADR5                            BANKMASK(SCANHADRL), 5, b
#define HADR6                            BANKMASK(SCANHADRL), 6, b
#define HADR7                            BANKMASK(SCANHADRL), 7, b
#define HADR8                            BANKMASK(SCANHADRH), 0, b
#define HADR9                            BANKMASK(SCANHADRH), 1, b
#define HFOEN                            BANKMASK(OSCEN), 6, b
#define HFOR                             BANKMASK(OSCSTAT), 6, b
#define HLVDEN                           BANKMASK(HLVDCON0), 7, b
#define HLVDIE                           BANKMASK(PIE0), 1, a
#define HLVDIF                           BANKMASK(PIR0), 1, a
#define HLVDINTH                         BANKMASK(HLVDCON0), 1, b
